zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K566/S32K566_device.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _S32K566_DEVICE_H_
#define _S32K566_DEVICE_H_              _S32K566_DEVICE_H_

/* ----------------------------------------------------------------------------
   -- CAN Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_Peripheral_Access_Layer CAN Peripheral Access Layer
 * @{
 */


/** FLEXCAN - Size of Registers Arrays */
#define CAN_RXIMR_COUNT                 FLEXCAN_RXIMR_COUNT
#define CAN_HR_TIME_STAMP_COUNT         FLEXCAN_HR_TIME_STAMP_COUNT
#define CAN_ERFFEL_COUNT                FLEXCAN_ERFFEL_COUNT

/** FLEXCAN - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration, offset: 0x0 */
  __IO uint32_t CTRL1;                             /**< Control 1, offset: 0x4 */
  __IO uint32_t TIMER;                             /**< Free-Running Timer, offset: 0x8 */
  uint8_t RESERVED_0[4];
  __IO uint32_t RXMGMASK;                          /**< RX Message Buffers Global Mask, offset: 0x10 */
  __IO uint32_t RX14MASK;                          /**< Receive 14 Mask, offset: 0x14 */
  __IO uint32_t RX15MASK;                          /**< Receive 15 Mask, offset: 0x18 */
  __IO uint32_t ECR;                               /**< Error Counter, offset: 0x1C */
  __IO uint32_t ESR1;                              /**< Error and Status 1, offset: 0x20 */
  __IO uint32_t IMASK2;                            /**< Interrupt Masks 2, offset: 0x24 */
  __IO uint32_t IMASK1;                            /**< Interrupt Masks 1, offset: 0x28 */
  __IO uint32_t IFLAG2;                            /**< Interrupt Flags 2, offset: 0x2C */
  __IO uint32_t IFLAG1;                            /**< Interrupt Flags 1, offset: 0x30 */
  __IO uint32_t CTRL2;                             /**< Control 2, offset: 0x34 */
  __I  uint32_t ESR2;                              /**< Error and Status 2, offset: 0x38 */
  uint8_t RESERVED_1[8];
  __I  uint32_t CRCR;                              /**< Cyclic Redundancy Check, offset: 0x44 */
  __IO uint32_t RXFGMASK;                          /**< Legacy RX FIFO Global Mask, offset: 0x48 */
  __I  uint32_t RXFIR;                             /**< Legacy RX FIFO Information, offset: 0x4C */
  __IO uint32_t CBT;                               /**< CAN Bit Timing, offset: 0x50 */
  uint8_t RESERVED_2[24];
  __IO uint32_t IMASK3;                            /**< Interrupt Masks 3, offset: 0x6C */
  uint8_t RESERVED_3[4];
  __IO uint32_t IFLAG3;                            /**< Interrupt Flags 3, offset: 0x74 */
  __I  uint32_t ET;                                /**< External Timer, offset: 0x78 */
  __IO uint32_t FLTCONF_IE;                        /**< Fault Confinement Interrupt Enable, offset: 0x7C */
  struct
   {                                               /* offset: 0x80, array step: 0x10 */
      __IO uint32_t CS;                            /**< Message Buffer 0 CS Register..Message Buffer 96 CS Register, array offset: 0x80, array step: 0x10 */
      __IO uint32_t ID;                            /**< Message Buffer 0 ID Register..Message Buffer 96 ID Register, array offset: 0x84, array step: 0x10 */
      __IO uint32_t WORD0;                         /**< Message Buffer 0 WORD0 Register..Message Buffer 96 WORD0 Register, array offset: 0x88, array step: 0x10 */
      __IO uint32_t WORD1;                         /**< Message Buffer 0 WORD1 Register..Message Buffer 96 WORD1 Register, array offset: 0x8C, array step: 0x10 */
   } MB[96];
  uint8_t RESERVED_4[512];
  __IO uint32_t RXIMR[FLEXCAN_RXIMR_COUNT];        /**< Receive Individual Mask, array offset: 0x880, array step: 0x4 */
  uint8_t RESERVED_5[224];
  __IO uint32_t MECR;                              /**< Memory Error Control, offset: 0xAE0 */
  __IO uint32_t ERRIAR;                            /**< Error Injection Address, offset: 0xAE4 */
  __IO uint32_t ERRIDPR;                           /**< Error Injection Data Pattern, offset: 0xAE8 */
  __IO uint32_t ERRIPPR;                           /**< Error Injection Parity Pattern, offset: 0xAEC */
  __I  uint32_t RERRAR;                            /**< Error Report Address, offset: 0xAF0 */
  __I  uint32_t RERRDR;                            /**< Error Report Data, offset: 0xAF4 */
  __I  uint32_t RERRSYNR;                          /**< Error Report Syndrome, offset: 0xAF8 */
  __IO uint32_t ERRSR;                             /**< Error Status, offset: 0xAFC */
  uint8_t RESERVED_6[240];
  __IO uint32_t EPRS;                              /**< Enhanced CAN Bit Timing Prescalers, offset: 0xBF0 */
  __IO uint32_t ENCBT;                             /**< Enhanced Nominal CAN Bit Timing, offset: 0xBF4 */
  __IO uint32_t EDCBT;                             /**< Enhanced Data Phase CAN Bit Timing, offset: 0xBF8 */
  __IO uint32_t ETDC;                              /**< Enhanced Transceiver Delay Compensation, offset: 0xBFC */
  __IO uint32_t FDCTRL;                            /**< CAN FD Control, offset: 0xC00 */
  __IO uint32_t FDCBT;                             /**< CAN FD Bit Timing, offset: 0xC04 */
  __I  uint32_t FDCRC;                             /**< CAN FD CRC, offset: 0xC08 */
  __IO uint32_t ERFCR;                             /**< Enhanced RX FIFO Control, offset: 0xC0C */
  __IO uint32_t ERFIER;                            /**< Enhanced RX FIFO Interrupt Enable, offset: 0xC10 */
  __IO uint32_t ERFSR;                             /**< Enhanced RX FIFO Status, offset: 0xC14 */
  uint8_t RESERVED_7[24];
  __IO uint32_t HR_TIME_STAMP[FLEXCAN_HR_TIME_STAMP_COUNT]; /**< High-Resolution Timestamp, array offset: 0xC30, array step: 0x4 */
  uint8_t RESERVED_8[8784];
  __IO uint32_t ERFFEL[FLEXCAN_ERFFEL_COUNT];      /**< Enhanced RX FIFO Filter Element, array offset: 0x3000, array step: 0x4 */
} CAN_Type;


/* ----------------------------------------------------------------------------
   -- FLEXCAN Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXCAN_Register_Masks FLEXCAN Register Masks
 * @{
 */

/*! @name MCR - Module Configuration */
/*! @{ */

#define CAN_MCR_MAXMB_MASK              FLEXCAN_MCR_MAXMB_MASK
#define CAN_MCR_MAXMB_SHIFT             FLEXCAN_MCR_MAXMB_SHIFT
#define CAN_MCR_MAXMB_WIDTH             FLEXCAN_MCR_MAXMB_WIDTH
#define CAN_MCR_MAXMB(x)                FLEXCAN_MCR_MAXMB(x)

#define CAN_MCR_TPOE_MASK               FLEXCAN_MCR_TPOE_MASK
#define CAN_MCR_TPOE_SHIFT              FLEXCAN_MCR_TPOE_SHIFT
#define CAN_MCR_TPOE_WIDTH              FLEXCAN_MCR_TPOE_WIDTH
#define CAN_MCR_TPOE(x)                 FLEXCAN_MCR_TPOE(x)

#define CAN_MCR_IDAM_MASK               FLEXCAN_MCR_IDAM_MASK
#define CAN_MCR_IDAM_SHIFT              FLEXCAN_MCR_IDAM_SHIFT
#define CAN_MCR_IDAM_WIDTH              FLEXCAN_MCR_IDAM_WIDTH
#define CAN_MCR_IDAM(x)                 FLEXCAN_MCR_IDAM(x)

#define CAN_MCR_TPOV_MASK               FLEXCAN_MCR_TPOV_MASK
#define CAN_MCR_TPOV_SHIFT              FLEXCAN_MCR_TPOV_SHIFT
#define CAN_MCR_TPOV_WIDTH              FLEXCAN_MCR_TPOV_WIDTH
#define CAN_MCR_TPOV(x)                 FLEXCAN_MCR_TPOV(x)

#define CAN_MCR_FDEN_MASK               FLEXCAN_MCR_FDEN_MASK
#define CAN_MCR_FDEN_SHIFT              FLEXCAN_MCR_FDEN_SHIFT
#define CAN_MCR_FDEN_WIDTH              FLEXCAN_MCR_FDEN_WIDTH
#define CAN_MCR_FDEN(x)                 FLEXCAN_MCR_FDEN(x)

#define CAN_MCR_AEN_MASK                FLEXCAN_MCR_AEN_MASK
#define CAN_MCR_AEN_SHIFT               FLEXCAN_MCR_AEN_SHIFT
#define CAN_MCR_AEN_WIDTH               FLEXCAN_MCR_AEN_WIDTH
#define CAN_MCR_AEN(x)                  FLEXCAN_MCR_AEN(x)

#define CAN_MCR_LPRIOEN_MASK            FLEXCAN_MCR_LPRIOEN_MASK
#define CAN_MCR_LPRIOEN_SHIFT           FLEXCAN_MCR_LPRIOEN_SHIFT
#define CAN_MCR_LPRIOEN_WIDTH           FLEXCAN_MCR_LPRIOEN_WIDTH
#define CAN_MCR_LPRIOEN(x)              FLEXCAN_MCR_LPRIOEN(x)

#define CAN_MCR_DMA_MASK                FLEXCAN_MCR_DMA_MASK
#define CAN_MCR_DMA_SHIFT               FLEXCAN_MCR_DMA_SHIFT
#define CAN_MCR_DMA_WIDTH               FLEXCAN_MCR_DMA_WIDTH
#define CAN_MCR_DMA(x)                  FLEXCAN_MCR_DMA(x)

#define CAN_MCR_IRMQ_MASK               FLEXCAN_MCR_IRMQ_MASK
#define CAN_MCR_IRMQ_SHIFT              FLEXCAN_MCR_IRMQ_SHIFT
#define CAN_MCR_IRMQ_WIDTH              FLEXCAN_MCR_IRMQ_WIDTH
#define CAN_MCR_IRMQ(x)                 FLEXCAN_MCR_IRMQ(x)

#define CAN_MCR_SRXDIS_MASK             FLEXCAN_MCR_SRXDIS_MASK
#define CAN_MCR_SRXDIS_SHIFT            FLEXCAN_MCR_SRXDIS_SHIFT
#define CAN_MCR_SRXDIS_WIDTH            FLEXCAN_MCR_SRXDIS_WIDTH
#define CAN_MCR_SRXDIS(x)               FLEXCAN_MCR_SRXDIS(x)

