zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K566/S32K566_device.h
#define CAN_MCR_LPMACK_MASK             FLEXCAN_MCR_LPMACK_MASK
#define CAN_MCR_LPMACK_SHIFT            FLEXCAN_MCR_LPMACK_SHIFT
#define CAN_MCR_LPMACK_WIDTH            FLEXCAN_MCR_LPMACK_WIDTH
#define CAN_MCR_LPMACK(x)               FLEXCAN_MCR_LPMACK(x)

#define CAN_MCR_WRNEN_MASK              FLEXCAN_MCR_WRNEN_MASK
#define CAN_MCR_WRNEN_SHIFT             FLEXCAN_MCR_WRNEN_SHIFT
#define CAN_MCR_WRNEN_WIDTH             FLEXCAN_MCR_WRNEN_WIDTH
#define CAN_MCR_WRNEN(x)                FLEXCAN_MCR_WRNEN(x)

#define CAN_MCR_SUPV_MASK               FLEXCAN_MCR_SUPV_MASK
#define CAN_MCR_SUPV_SHIFT              FLEXCAN_MCR_SUPV_SHIFT
#define CAN_MCR_SUPV_WIDTH              FLEXCAN_MCR_SUPV_WIDTH
#define CAN_MCR_SUPV(x)                 FLEXCAN_MCR_SUPV(x)

#define CAN_MCR_FRZACK_MASK             FLEXCAN_MCR_FRZACK_MASK
#define CAN_MCR_FRZACK_SHIFT            FLEXCAN_MCR_FRZACK_SHIFT
#define CAN_MCR_FRZACK_WIDTH            FLEXCAN_MCR_FRZACK_WIDTH
#define CAN_MCR_FRZACK(x)               FLEXCAN_MCR_FRZACK(x)

#define CAN_MCR_SOFTRST_MASK            FLEXCAN_MCR_SOFTRST_MASK
#define CAN_MCR_SOFTRST_SHIFT           FLEXCAN_MCR_SOFTRST_SHIFT
#define CAN_MCR_SOFTRST_WIDTH           FLEXCAN_MCR_SOFTRST_WIDTH
#define CAN_MCR_SOFTRST(x)              FLEXCAN_MCR_SOFTRST(x)

#define CAN_MCR_NOTRDY_MASK             FLEXCAN_MCR_NOTRDY_MASK
#define CAN_MCR_NOTRDY_SHIFT            FLEXCAN_MCR_NOTRDY_SHIFT
#define CAN_MCR_NOTRDY_WIDTH            FLEXCAN_MCR_NOTRDY_WIDTH
#define CAN_MCR_NOTRDY(x)               FLEXCAN_MCR_NOTRDY(x)

#define CAN_MCR_HALT_MASK               FLEXCAN_MCR_HALT_MASK
#define CAN_MCR_HALT_SHIFT              FLEXCAN_MCR_HALT_SHIFT
#define CAN_MCR_HALT_WIDTH              FLEXCAN_MCR_HALT_WIDTH
#define CAN_MCR_HALT(x)                 FLEXCAN_MCR_HALT(x)

#define CAN_MCR_RFEN_MASK               FLEXCAN_MCR_RFEN_MASK
#define CAN_MCR_RFEN_SHIFT              FLEXCAN_MCR_RFEN_SHIFT
#define CAN_MCR_RFEN_WIDTH              FLEXCAN_MCR_RFEN_WIDTH
#define CAN_MCR_RFEN(x)                 FLEXCAN_MCR_RFEN(x)

#define CAN_MCR_FRZ_MASK                FLEXCAN_MCR_FRZ_MASK
#define CAN_MCR_FRZ_SHIFT               FLEXCAN_MCR_FRZ_SHIFT
#define CAN_MCR_FRZ_WIDTH               FLEXCAN_MCR_FRZ_WIDTH
#define CAN_MCR_FRZ(x)                  FLEXCAN_MCR_FRZ(x)

#define CAN_MCR_MDIS_MASK               FLEXCAN_MCR_MDIS_MASK
#define CAN_MCR_MDIS_SHIFT              FLEXCAN_MCR_MDIS_SHIFT
#define CAN_MCR_MDIS_WIDTH              FLEXCAN_MCR_MDIS_WIDTH
#define CAN_MCR_MDIS(x)                 FLEXCAN_MCR_MDIS(x)
/*! @} */

/*! @name CTRL1 - Control 1 */
/*! @{ */

#define CAN_CTRL1_PROPSEG_MASK          FLEXCAN_CTRL1_PROPSEG_MASK
#define CAN_CTRL1_PROPSEG_SHIFT         FLEXCAN_CTRL1_PROPSEG_SHIFT
#define CAN_CTRL1_PROPSEG_WIDTH         FLEXCAN_CTRL1_PROPSEG_WIDTH
#define CAN_CTRL1_PROPSEG(x)            FLEXCAN_CTRL1_PROPSEG(x)

#define CAN_CTRL1_LOM_MASK              FLEXCAN_CTRL1_LOM_MASK
#define CAN_CTRL1_LOM_SHIFT             FLEXCAN_CTRL1_LOM_SHIFT
#define CAN_CTRL1_LOM_WIDTH             FLEXCAN_CTRL1_LOM_WIDTH
#define CAN_CTRL1_LOM(x)                FLEXCAN_CTRL1_LOM(x)

#define CAN_CTRL1_LBUF_MASK             FLEXCAN_CTRL1_LBUF_MASK
#define CAN_CTRL1_LBUF_SHIFT            FLEXCAN_CTRL1_LBUF_SHIFT
#define CAN_CTRL1_LBUF_WIDTH            FLEXCAN_CTRL1_LBUF_WIDTH
#define CAN_CTRL1_LBUF(x)               FLEXCAN_CTRL1_LBUF(x)

#define CAN_CTRL1_TSYN_MASK             FLEXCAN_CTRL1_TSYN_MASK
#define CAN_CTRL1_TSYN_SHIFT            FLEXCAN_CTRL1_TSYN_SHIFT
#define CAN_CTRL1_TSYN_WIDTH            FLEXCAN_CTRL1_TSYN_WIDTH
#define CAN_CTRL1_TSYN(x)               FLEXCAN_CTRL1_TSYN(x)

#define CAN_CTRL1_BOFFREC_MASK          FLEXCAN_CTRL1_BOFFREC_MASK
#define CAN_CTRL1_BOFFREC_SHIFT         FLEXCAN_CTRL1_BOFFREC_SHIFT
#define CAN_CTRL1_BOFFREC_WIDTH         FLEXCAN_CTRL1_BOFFREC_WIDTH
#define CAN_CTRL1_BOFFREC(x)            FLEXCAN_CTRL1_BOFFREC(x)

#define CAN_CTRL1_SMP_MASK              FLEXCAN_CTRL1_SMP_MASK
#define CAN_CTRL1_SMP_SHIFT             FLEXCAN_CTRL1_SMP_SHIFT
#define CAN_CTRL1_SMP_WIDTH             FLEXCAN_CTRL1_SMP_WIDTH
#define CAN_CTRL1_SMP(x)                FLEXCAN_CTRL1_SMP(x)

#define CAN_CTRL1_ROM_MASK              FLEXCAN_CTRL1_ROM_MASK
#define CAN_CTRL1_ROM_SHIFT             FLEXCAN_CTRL1_ROM_SHIFT
#define CAN_CTRL1_ROM_WIDTH             FLEXCAN_CTRL1_ROM_WIDTH
#define CAN_CTRL1_ROM(x)                FLEXCAN_CTRL1_ROM(x)

#define CAN_CTRL1_RWRNMSK_MASK          FLEXCAN_CTRL1_RWRNMSK_MASK
#define CAN_CTRL1_RWRNMSK_SHIFT         FLEXCAN_CTRL1_RWRNMSK_SHIFT
#define CAN_CTRL1_RWRNMSK_WIDTH         FLEXCAN_CTRL1_RWRNMSK_WIDTH
#define CAN_CTRL1_RWRNMSK(x)            FLEXCAN_CTRL1_RWRNMSK(x)

#define CAN_CTRL1_TWRNMSK_MASK          FLEXCAN_CTRL1_TWRNMSK_MASK
#define CAN_CTRL1_TWRNMSK_SHIFT         FLEXCAN_CTRL1_TWRNMSK_SHIFT
#define CAN_CTRL1_TWRNMSK_WIDTH         FLEXCAN_CTRL1_TWRNMSK_WIDTH
#define CAN_CTRL1_TWRNMSK(x)            FLEXCAN_CTRL1_TWRNMSK(x)

#define CAN_CTRL1_LPB_MASK              FLEXCAN_CTRL1_LPB_MASK
#define CAN_CTRL1_LPB_SHIFT             FLEXCAN_CTRL1_LPB_SHIFT
#define CAN_CTRL1_LPB_WIDTH             FLEXCAN_CTRL1_LPB_WIDTH
#define CAN_CTRL1_LPB(x)                FLEXCAN_CTRL1_LPB(x)

#define CAN_CTRL1_ERRMSK_MASK           FLEXCAN_CTRL1_ERRMSK_MASK
#define CAN_CTRL1_ERRMSK_SHIFT          FLEXCAN_CTRL1_ERRMSK_SHIFT
#define CAN_CTRL1_ERRMSK_WIDTH          FLEXCAN_CTRL1_ERRMSK_WIDTH
#define CAN_CTRL1_ERRMSK(x)             FLEXCAN_CTRL1_ERRMSK(x)

#define CAN_CTRL1_BOFFMSK_MASK          FLEXCAN_CTRL1_BOFFMSK_MASK
#define CAN_CTRL1_BOFFMSK_SHIFT         FLEXCAN_CTRL1_BOFFMSK_SHIFT
#define CAN_CTRL1_BOFFMSK_WIDTH         FLEXCAN_CTRL1_BOFFMSK_WIDTH
#define CAN_CTRL1_BOFFMSK(x)            FLEXCAN_CTRL1_BOFFMSK(x)

#define CAN_CTRL1_PSEG2_MASK            FLEXCAN_CTRL1_PSEG2_MASK
#define CAN_CTRL1_PSEG2_SHIFT           FLEXCAN_CTRL1_PSEG2_SHIFT
#define CAN_CTRL1_PSEG2_WIDTH           FLEXCAN_CTRL1_PSEG2_WIDTH
#define CAN_CTRL1_PSEG2(x)              FLEXCAN_CTRL1_PSEG2(x)

#define CAN_CTRL1_PSEG1_MASK            FLEXCAN_CTRL1_PSEG1_MASK
#define CAN_CTRL1_PSEG1_SHIFT           FLEXCAN_CTRL1_PSEG1_SHIFT
#define CAN_CTRL1_PSEG1_WIDTH           FLEXCAN_CTRL1_PSEG1_WIDTH
#define CAN_CTRL1_PSEG1(x)              FLEXCAN_CTRL1_PSEG1(x)

#define CAN_CTRL1_RJW_MASK              FLEXCAN_CTRL1_RJW_MASK
#define CAN_CTRL1_RJW_SHIFT             FLEXCAN_CTRL1_RJW_SHIFT
#define CAN_CTRL1_RJW_WIDTH             FLEXCAN_CTRL1_RJW_WIDTH
#define CAN_CTRL1_RJW(x)                FLEXCAN_CTRL1_RJW(x)

#define CAN_CTRL1_PRESDIV_MASK          FLEXCAN_CTRL1_PRESDIV_MASK
#define CAN_CTRL1_PRESDIV_SHIFT         FLEXCAN_CTRL1_PRESDIV_SHIFT
#define CAN_CTRL1_PRESDIV_WIDTH         FLEXCAN_CTRL1_PRESDIV_WIDTH
#define CAN_CTRL1_PRESDIV(x)            FLEXCAN_CTRL1_PRESDIV(x)
/*! @} */

/*! @name TIMER - Free-Running Timer */
/*! @{ */

#define CAN_TIMER_TIMER_MASK            FLEXCAN_TIMER_TIMER_MASK
#define CAN_TIMER_TIMER_SHIFT           FLEXCAN_TIMER_TIMER_SHIFT
#define CAN_TIMER_TIMER_WIDTH           FLEXCAN_TIMER_TIMER_WIDTH
#define CAN_TIMER_TIMER(x)              FLEXCAN_TIMER_TIMER(x)
/*! @} */

/*! @name RXMGMASK - RX Message Buffers Global Mask */
/*! @{ */

