zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K566/S32K566_device.h
#define CAN_RXMGMASK_MG_MASK            FLEXCAN_RXMGMASK_MG_MASK
#define CAN_RXMGMASK_MG_SHIFT           FLEXCAN_RXMGMASK_MG_SHIFT
#define CAN_RXMGMASK_MG_WIDTH           FLEXCAN_RXMGMASK_MG_WIDTH
#define CAN_RXMGMASK_MG(x)              FLEXCAN_RXMGMASK_MG(x)
/*! @} */

/*! @name RX14MASK - Receive 14 Mask */
/*! @{ */

#define CAN_RX14MASK_RX14M_MASK         FLEXCAN_RX14MASK_RX14M_MASK
#define CAN_RX14MASK_RX14M_SHIFT        FLEXCAN_RX14MASK_RX14M_SHIFT
#define CAN_RX14MASK_RX14M_WIDTH        FLEXCAN_RX14MASK_RX14M_WIDTH
#define CAN_RX14MASK_RX14M(x)           FLEXCAN_RX14MASK_RX14M(x)
/*! @} */

/*! @name RX15MASK - Receive 15 Mask */
/*! @{ */

#define CAN_RX15MASK_RX15M_MASK         FLEXCAN_RX15MASK_RX15M_MASK
#define CAN_RX15MASK_RX15M_SHIFT        FLEXCAN_RX15MASK_RX15M_SHIFT
#define CAN_RX15MASK_RX15M_WIDTH        FLEXCAN_RX15MASK_RX15M_WIDTH
#define CAN_RX15MASK_RX15M(x)           FLEXCAN_RX15MASK_RX15M(x)
/*! @} */

/*! @name ECR - Error Counter */
/*! @{ */

#define CAN_ECR_TXERRCNT_MASK           FLEXCAN_ECR_TXERRCNT_MASK
#define CAN_ECR_TXERRCNT_SHIFT          FLEXCAN_ECR_TXERRCNT_SHIFT
#define CAN_ECR_TXERRCNT_WIDTH          FLEXCAN_ECR_TXERRCNT_WIDTH
#define CAN_ECR_TXERRCNT(x)             FLEXCAN_ECR_TXERRCNT(x)

#define CAN_ECR_RXERRCNT_MASK           FLEXCAN_ECR_RXERRCNT_MASK
#define CAN_ECR_RXERRCNT_SHIFT          FLEXCAN_ECR_RXERRCNT_SHIFT
#define CAN_ECR_RXERRCNT_WIDTH          FLEXCAN_ECR_RXERRCNT_WIDTH
#define CAN_ECR_RXERRCNT(x)             FLEXCAN_ECR_RXERRCNT(x)

#define CAN_ECR_TXERRCNT_FAST_MASK      FLEXCAN_ECR_TXERRCNT_FAST_MASK
#define CAN_ECR_TXERRCNT_FAST_SHIFT     FLEXCAN_ECR_TXERRCNT_FAST_SHIFT
#define CAN_ECR_TXERRCNT_FAST_WIDTH     FLEXCAN_ECR_TXERRCNT_FAST_WIDTH
#define CAN_ECR_TXERRCNT_FAST(x)        FLEXCAN_ECR_TXERRCNT_FAST(x)

#define CAN_ECR_RXERRCNT_FAST_MASK      FLEXCAN_ECR_RXERRCNT_FAST_MASK
#define CAN_ECR_RXERRCNT_FAST_SHIFT     FLEXCAN_ECR_RXERRCNT_FAST_SHIFT
#define CAN_ECR_RXERRCNT_FAST_WIDTH     FLEXCAN_ECR_RXERRCNT_FAST_WIDTH
#define CAN_ECR_RXERRCNT_FAST(x)        FLEXCAN_ECR_RXERRCNT_FAST(x)
/*! @} */

/*! @name ESR1 - Error and Status 1 */
/*! @{ */

#define CAN_ESR1_ERRINT_MASK            FLEXCAN_ESR1_ERRINT_MASK
#define CAN_ESR1_ERRINT_SHIFT           FLEXCAN_ESR1_ERRINT_SHIFT
#define CAN_ESR1_ERRINT_WIDTH           FLEXCAN_ESR1_ERRINT_WIDTH
#define CAN_ESR1_ERRINT(x)              FLEXCAN_ESR1_ERRINT(x)

#define CAN_ESR1_BOFFINT_MASK           FLEXCAN_ESR1_BOFFINT_MASK
#define CAN_ESR1_BOFFINT_SHIFT          FLEXCAN_ESR1_BOFFINT_SHIFT
#define CAN_ESR1_BOFFINT_WIDTH          FLEXCAN_ESR1_BOFFINT_WIDTH
#define CAN_ESR1_BOFFINT(x)             FLEXCAN_ESR1_BOFFINT(x)

#define CAN_ESR1_RX_MASK                FLEXCAN_ESR1_RX_MASK
#define CAN_ESR1_RX_SHIFT               FLEXCAN_ESR1_RX_SHIFT
#define CAN_ESR1_RX_WIDTH               FLEXCAN_ESR1_RX_WIDTH
#define CAN_ESR1_RX(x)                  FLEXCAN_ESR1_RX(x)

#define CAN_ESR1_FLTCONF_MASK           FLEXCAN_ESR1_FLTCONF_MASK
#define CAN_ESR1_FLTCONF_SHIFT          FLEXCAN_ESR1_FLTCONF_SHIFT
#define CAN_ESR1_FLTCONF_WIDTH          FLEXCAN_ESR1_FLTCONF_WIDTH
#define CAN_ESR1_FLTCONF(x)             FLEXCAN_ESR1_FLTCONF(x)

#define CAN_ESR1_TX_MASK                FLEXCAN_ESR1_TX_MASK
#define CAN_ESR1_TX_SHIFT               FLEXCAN_ESR1_TX_SHIFT
#define CAN_ESR1_TX_WIDTH               FLEXCAN_ESR1_TX_WIDTH
#define CAN_ESR1_TX(x)                  FLEXCAN_ESR1_TX(x)

#define CAN_ESR1_IDLE_MASK              FLEXCAN_ESR1_IDLE_MASK
#define CAN_ESR1_IDLE_SHIFT             FLEXCAN_ESR1_IDLE_SHIFT
#define CAN_ESR1_IDLE_WIDTH             FLEXCAN_ESR1_IDLE_WIDTH
#define CAN_ESR1_IDLE(x)                FLEXCAN_ESR1_IDLE(x)

#define CAN_ESR1_RXWRN_MASK             FLEXCAN_ESR1_RXWRN_MASK
#define CAN_ESR1_RXWRN_SHIFT            FLEXCAN_ESR1_RXWRN_SHIFT
#define CAN_ESR1_RXWRN_WIDTH            FLEXCAN_ESR1_RXWRN_WIDTH
#define CAN_ESR1_RXWRN(x)               FLEXCAN_ESR1_RXWRN(x)

#define CAN_ESR1_TXWRN_MASK             FLEXCAN_ESR1_TXWRN_MASK
#define CAN_ESR1_TXWRN_SHIFT            FLEXCAN_ESR1_TXWRN_SHIFT
#define CAN_ESR1_TXWRN_WIDTH            FLEXCAN_ESR1_TXWRN_WIDTH
#define CAN_ESR1_TXWRN(x)               FLEXCAN_ESR1_TXWRN(x)

#define CAN_ESR1_STFERR_MASK            FLEXCAN_ESR1_STFERR_MASK
#define CAN_ESR1_STFERR_SHIFT           FLEXCAN_ESR1_STFERR_SHIFT
#define CAN_ESR1_STFERR_WIDTH           FLEXCAN_ESR1_STFERR_WIDTH
#define CAN_ESR1_STFERR(x)              FLEXCAN_ESR1_STFERR(x)

#define CAN_ESR1_FRMERR_MASK            FLEXCAN_ESR1_FRMERR_MASK
#define CAN_ESR1_FRMERR_SHIFT           FLEXCAN_ESR1_FRMERR_SHIFT
#define CAN_ESR1_FRMERR_WIDTH           FLEXCAN_ESR1_FRMERR_WIDTH
#define CAN_ESR1_FRMERR(x)              FLEXCAN_ESR1_FRMERR(x)

#define CAN_ESR1_CRCERR_MASK            FLEXCAN_ESR1_CRCERR_MASK
#define CAN_ESR1_CRCERR_SHIFT           FLEXCAN_ESR1_CRCERR_SHIFT
#define CAN_ESR1_CRCERR_WIDTH           FLEXCAN_ESR1_CRCERR_WIDTH
#define CAN_ESR1_CRCERR(x)              FLEXCAN_ESR1_CRCERR(x)

#define CAN_ESR1_ACKERR_MASK            FLEXCAN_ESR1_ACKERR_MASK
#define CAN_ESR1_ACKERR_SHIFT           FLEXCAN_ESR1_ACKERR_SHIFT
#define CAN_ESR1_ACKERR_WIDTH           FLEXCAN_ESR1_ACKERR_WIDTH
#define CAN_ESR1_ACKERR(x)              FLEXCAN_ESR1_ACKERR(x)

#define CAN_ESR1_BIT0ERR_MASK           FLEXCAN_ESR1_BIT0ERR_MASK
#define CAN_ESR1_BIT0ERR_SHIFT          FLEXCAN_ESR1_BIT0ERR_SHIFT
#define CAN_ESR1_BIT0ERR_WIDTH          FLEXCAN_ESR1_BIT0ERR_WIDTH
#define CAN_ESR1_BIT0ERR(x)             FLEXCAN_ESR1_BIT0ERR(x)

#define CAN_ESR1_BIT1ERR_MASK           FLEXCAN_ESR1_BIT1ERR_MASK
#define CAN_ESR1_BIT1ERR_SHIFT          FLEXCAN_ESR1_BIT1ERR_SHIFT
#define CAN_ESR1_BIT1ERR_WIDTH          FLEXCAN_ESR1_BIT1ERR_WIDTH
#define CAN_ESR1_BIT1ERR(x)             FLEXCAN_ESR1_BIT1ERR(x)

#define CAN_ESR1_RWRNINT_MASK           FLEXCAN_ESR1_RWRNINT_MASK
#define CAN_ESR1_RWRNINT_SHIFT          FLEXCAN_ESR1_RWRNINT_SHIFT
#define CAN_ESR1_RWRNINT_WIDTH          FLEXCAN_ESR1_RWRNINT_WIDTH
#define CAN_ESR1_RWRNINT(x)             FLEXCAN_ESR1_RWRNINT(x)

