zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K566/S32K566_device.h
#define CAN_ESR1_TWRNINT_MASK           FLEXCAN_ESR1_TWRNINT_MASK
#define CAN_ESR1_TWRNINT_SHIFT          FLEXCAN_ESR1_TWRNINT_SHIFT
#define CAN_ESR1_TWRNINT_WIDTH          FLEXCAN_ESR1_TWRNINT_WIDTH
#define CAN_ESR1_TWRNINT(x)             FLEXCAN_ESR1_TWRNINT(x)

#define CAN_ESR1_SYNCH_MASK             FLEXCAN_ESR1_SYNCH_MASK
#define CAN_ESR1_SYNCH_SHIFT            FLEXCAN_ESR1_SYNCH_SHIFT
#define CAN_ESR1_SYNCH_WIDTH            FLEXCAN_ESR1_SYNCH_WIDTH
#define CAN_ESR1_SYNCH(x)               FLEXCAN_ESR1_SYNCH(x)

#define CAN_ESR1_BOFFDONEINT_MASK       FLEXCAN_ESR1_BOFFDONEINT_MASK
#define CAN_ESR1_BOFFDONEINT_SHIFT      FLEXCAN_ESR1_BOFFDONEINT_SHIFT
#define CAN_ESR1_BOFFDONEINT_WIDTH      FLEXCAN_ESR1_BOFFDONEINT_WIDTH
#define CAN_ESR1_BOFFDONEINT(x)         FLEXCAN_ESR1_BOFFDONEINT(x)

#define CAN_ESR1_ERRINT_FAST_MASK       FLEXCAN_ESR1_ERRINT_FAST_MASK
#define CAN_ESR1_ERRINT_FAST_SHIFT      FLEXCAN_ESR1_ERRINT_FAST_SHIFT
#define CAN_ESR1_ERRINT_FAST_WIDTH      FLEXCAN_ESR1_ERRINT_FAST_WIDTH
#define CAN_ESR1_ERRINT_FAST(x)         FLEXCAN_ESR1_ERRINT_FAST(x)

#define CAN_ESR1_ERROVR_MASK            FLEXCAN_ESR1_ERROVR_MASK
#define CAN_ESR1_ERROVR_SHIFT           FLEXCAN_ESR1_ERROVR_SHIFT
#define CAN_ESR1_ERROVR_WIDTH           FLEXCAN_ESR1_ERROVR_WIDTH
#define CAN_ESR1_ERROVR(x)              FLEXCAN_ESR1_ERROVR(x)

#define CAN_ESR1_ATP_MASK               FLEXCAN_ESR1_ATP_MASK
#define CAN_ESR1_ATP_SHIFT              FLEXCAN_ESR1_ATP_SHIFT
#define CAN_ESR1_ATP_WIDTH              FLEXCAN_ESR1_ATP_WIDTH
#define CAN_ESR1_ATP(x)                 FLEXCAN_ESR1_ATP(x)

#define CAN_ESR1_PTA_MASK               FLEXCAN_ESR1_PTA_MASK
#define CAN_ESR1_PTA_SHIFT              FLEXCAN_ESR1_PTA_SHIFT
#define CAN_ESR1_PTA_WIDTH              FLEXCAN_ESR1_PTA_WIDTH
#define CAN_ESR1_PTA(x)                 FLEXCAN_ESR1_PTA(x)

#define CAN_ESR1_STFERR_FAST_MASK       FLEXCAN_ESR1_STFERR_FAST_MASK
#define CAN_ESR1_STFERR_FAST_SHIFT      FLEXCAN_ESR1_STFERR_FAST_SHIFT
#define CAN_ESR1_STFERR_FAST_WIDTH      FLEXCAN_ESR1_STFERR_FAST_WIDTH
#define CAN_ESR1_STFERR_FAST(x)         FLEXCAN_ESR1_STFERR_FAST(x)

#define CAN_ESR1_FRMERR_FAST_MASK       FLEXCAN_ESR1_FRMERR_FAST_MASK
#define CAN_ESR1_FRMERR_FAST_SHIFT      FLEXCAN_ESR1_FRMERR_FAST_SHIFT
#define CAN_ESR1_FRMERR_FAST_WIDTH      FLEXCAN_ESR1_FRMERR_FAST_WIDTH
#define CAN_ESR1_FRMERR_FAST(x)         FLEXCAN_ESR1_FRMERR_FAST(x)

#define CAN_ESR1_CRCERR_FAST_MASK       FLEXCAN_ESR1_CRCERR_FAST_MASK
#define CAN_ESR1_CRCERR_FAST_SHIFT      FLEXCAN_ESR1_CRCERR_FAST_SHIFT
#define CAN_ESR1_CRCERR_FAST_WIDTH      FLEXCAN_ESR1_CRCERR_FAST_WIDTH
#define CAN_ESR1_CRCERR_FAST(x)         FLEXCAN_ESR1_CRCERR_FAST(x)

#define CAN_ESR1_BIT0ERR_FAST_MASK      FLEXCAN_ESR1_BIT0ERR_FAST_MASK
#define CAN_ESR1_BIT0ERR_FAST_SHIFT     FLEXCAN_ESR1_BIT0ERR_FAST_SHIFT
#define CAN_ESR1_BIT0ERR_FAST_WIDTH     FLEXCAN_ESR1_BIT0ERR_FAST_WIDTH
#define CAN_ESR1_BIT0ERR_FAST(x)        FLEXCAN_ESR1_BIT0ERR_FAST(x)

#define CAN_ESR1_BIT1ERR_FAST_MASK      FLEXCAN_ESR1_BIT1ERR_FAST_MASK
#define CAN_ESR1_BIT1ERR_FAST_SHIFT     FLEXCAN_ESR1_BIT1ERR_FAST_SHIFT
#define CAN_ESR1_BIT1ERR_FAST_WIDTH     FLEXCAN_ESR1_BIT1ERR_FAST_WIDTH
#define CAN_ESR1_BIT1ERR_FAST(x)        FLEXCAN_ESR1_BIT1ERR_FAST(x)
/*! @} */

/*! @name IMASK2 - Interrupt Masks 2 */
/*! @{ */

#define CAN_IMASK2_BUF63TO32M_MASK      FLEXCAN_IMASK2_BUF63TO32M_MASK
#define CAN_IMASK2_BUF63TO32M_SHIFT     FLEXCAN_IMASK2_BUF63TO32M_SHIFT
#define CAN_IMASK2_BUF63TO32M_WIDTH     FLEXCAN_IMASK2_BUF63TO32M_WIDTH
#define CAN_IMASK2_BUF63TO32M(x)        FLEXCAN_IMASK2_BUF63TO32M(x)
/*! @} */

/*! @name IMASK1 - Interrupt Masks 1 */
/*! @{ */

#define CAN_IMASK1_BUF31TO0M_MASK       FLEXCAN_IMASK1_BUF31TO0M_MASK
#define CAN_IMASK1_BUF31TO0M_SHIFT      FLEXCAN_IMASK1_BUF31TO0M_SHIFT
#define CAN_IMASK1_BUF31TO0M_WIDTH      FLEXCAN_IMASK1_BUF31TO0M_WIDTH
#define CAN_IMASK1_BUF31TO0M(x)         FLEXCAN_IMASK1_BUF31TO0M(x)
/*! @} */

/*! @name IFLAG2 - Interrupt Flags 2 */
/*! @{ */

#define CAN_IFLAG2_BUF63TO32I_MASK      FLEXCAN_IFLAG2_BUF63TO32I_MASK
#define CAN_IFLAG2_BUF63TO32I_SHIFT     FLEXCAN_IFLAG2_BUF63TO32I_SHIFT
#define CAN_IFLAG2_BUF63TO32I_WIDTH     FLEXCAN_IFLAG2_BUF63TO32I_WIDTH
#define CAN_IFLAG2_BUF63TO32I(x)        FLEXCAN_IFLAG2_BUF63TO32I(x)
/*! @} */

/*! @name IFLAG1 - Interrupt Flags 1 */
/*! @{ */

#define CAN_IFLAG1_BUF0I_MASK           FLEXCAN_IFLAG1_BUF0I_MASK
#define CAN_IFLAG1_BUF0I_SHIFT          FLEXCAN_IFLAG1_BUF0I_SHIFT
#define CAN_IFLAG1_BUF0I_WIDTH          FLEXCAN_IFLAG1_BUF0I_WIDTH
#define CAN_IFLAG1_BUF0I(x)             FLEXCAN_IFLAG1_BUF0I(x)

#define CAN_IFLAG1_BUF4TO1I_MASK        FLEXCAN_IFLAG1_BUF4TO1I_MASK
#define CAN_IFLAG1_BUF4TO1I_SHIFT       FLEXCAN_IFLAG1_BUF4TO1I_SHIFT
#define CAN_IFLAG1_BUF4TO1I_WIDTH       FLEXCAN_IFLAG1_BUF4TO1I_WIDTH
#define CAN_IFLAG1_BUF4TO1I(x)          FLEXCAN_IFLAG1_BUF4TO1I(x)

#define CAN_IFLAG1_BUF5I_MASK           FLEXCAN_IFLAG1_BUF5I_MASK
#define CAN_IFLAG1_BUF5I_SHIFT          FLEXCAN_IFLAG1_BUF5I_SHIFT
#define CAN_IFLAG1_BUF5I_WIDTH          FLEXCAN_IFLAG1_BUF5I_WIDTH
#define CAN_IFLAG1_BUF5I(x)             FLEXCAN_IFLAG1_BUF5I(x)

#define CAN_IFLAG1_BUF6I_MASK           FLEXCAN_IFLAG1_BUF6I_MASK
#define CAN_IFLAG1_BUF6I_SHIFT          FLEXCAN_IFLAG1_BUF6I_SHIFT
#define CAN_IFLAG1_BUF6I_WIDTH          FLEXCAN_IFLAG1_BUF6I_WIDTH
#define CAN_IFLAG1_BUF6I(x)             FLEXCAN_IFLAG1_BUF6I(x)

#define CAN_IFLAG1_BUF7I_MASK           FLEXCAN_IFLAG1_BUF7I_MASK
#define CAN_IFLAG1_BUF7I_SHIFT          FLEXCAN_IFLAG1_BUF7I_SHIFT
#define CAN_IFLAG1_BUF7I_WIDTH          FLEXCAN_IFLAG1_BUF7I_WIDTH
#define CAN_IFLAG1_BUF7I(x)             FLEXCAN_IFLAG1_BUF7I(x)

#define CAN_IFLAG1_BUF31TO8I_MASK       FLEXCAN_IFLAG1_BUF31TO8I_MASK
#define CAN_IFLAG1_BUF31TO8I_SHIFT      FLEXCAN_IFLAG1_BUF31TO8I_SHIFT
#define CAN_IFLAG1_BUF31TO8I_WIDTH      FLEXCAN_IFLAG1_BUF31TO8I_WIDTH
#define CAN_IFLAG1_BUF31TO8I(x)         FLEXCAN_IFLAG1_BUF31TO8I(x)
/*! @} */

/*! @name CTRL2 - Control 2 */
/*! @{ */

#define CAN_CTRL2_PES_MASK              FLEXCAN_CTRL2_PES_MASK
#define CAN_CTRL2_PES_SHIFT             FLEXCAN_CTRL2_PES_SHIFT
#define CAN_CTRL2_PES_WIDTH             FLEXCAN_CTRL2_PES_WIDTH
#define CAN_CTRL2_PES(x)                FLEXCAN_CTRL2_PES(x)

#define CAN_CTRL2_ASD_MASK              FLEXCAN_CTRL2_ASD_MASK
#define CAN_CTRL2_ASD_SHIFT             FLEXCAN_CTRL2_ASD_SHIFT
#define CAN_CTRL2_ASD_WIDTH             FLEXCAN_CTRL2_ASD_WIDTH
#define CAN_CTRL2_ASD(x)                FLEXCAN_CTRL2_ASD(x)

#define CAN_CTRL2_RETRY_MASK            FLEXCAN_CTRL2_RETRY_MASK
#define CAN_CTRL2_RETRY_SHIFT           FLEXCAN_CTRL2_RETRY_SHIFT
#define CAN_CTRL2_RETRY_WIDTH           FLEXCAN_CTRL2_RETRY_WIDTH
#define CAN_CTRL2_RETRY(x)              FLEXCAN_CTRL2_RETRY(x)

#define CAN_CTRL2_TSTAMPCAP_MASK        FLEXCAN_CTRL2_TSTAMPCAP_MASK
#define CAN_CTRL2_TSTAMPCAP_SHIFT       FLEXCAN_CTRL2_TSTAMPCAP_SHIFT
#define CAN_CTRL2_TSTAMPCAP_WIDTH       FLEXCAN_CTRL2_TSTAMPCAP_WIDTH
#define CAN_CTRL2_TSTAMPCAP(x)          FLEXCAN_CTRL2_TSTAMPCAP(x)

#define CAN_CTRL2_MBTSBASE_MASK         FLEXCAN_CTRL2_MBTSBASE_MASK
#define CAN_CTRL2_MBTSBASE_SHIFT        FLEXCAN_CTRL2_MBTSBASE_SHIFT
#define CAN_CTRL2_MBTSBASE_WIDTH        FLEXCAN_CTRL2_MBTSBASE_WIDTH
#define CAN_CTRL2_MBTSBASE(x)           FLEXCAN_CTRL2_MBTSBASE(x)

#define CAN_CTRL2_FLT_RXN_MASK          FLEXCAN_CTRL2_FLT_RXN_MASK
#define CAN_CTRL2_FLT_RXN_SHIFT         FLEXCAN_CTRL2_FLT_RXN_SHIFT
#define CAN_CTRL2_FLT_RXN_WIDTH         FLEXCAN_CTRL2_FLT_RXN_WIDTH
#define CAN_CTRL2_FLT_RXN(x)            FLEXCAN_CTRL2_FLT_RXN(x)

#define CAN_CTRL2_EDFLTDIS_MASK         FLEXCAN_CTRL2_EDFLTDIS_MASK
#define CAN_CTRL2_EDFLTDIS_SHIFT        FLEXCAN_CTRL2_EDFLTDIS_SHIFT
#define CAN_CTRL2_EDFLTDIS_WIDTH        FLEXCAN_CTRL2_EDFLTDIS_WIDTH
#define CAN_CTRL2_EDFLTDIS(x)           FLEXCAN_CTRL2_EDFLTDIS(x)

#define CAN_CTRL2_ISOCANFDEN_MASK       FLEXCAN_CTRL2_ISOCANFDEN_MASK
#define CAN_CTRL2_ISOCANFDEN_SHIFT      FLEXCAN_CTRL2_ISOCANFDEN_SHIFT
#define CAN_CTRL2_ISOCANFDEN_WIDTH      FLEXCAN_CTRL2_ISOCANFDEN_WIDTH
#define CAN_CTRL2_ISOCANFDEN(x)         FLEXCAN_CTRL2_ISOCANFDEN(x)

#define CAN_CTRL2_BTE_MASK              FLEXCAN_CTRL2_BTE_MASK
#define CAN_CTRL2_BTE_SHIFT             FLEXCAN_CTRL2_BTE_SHIFT
#define CAN_CTRL2_BTE_WIDTH             FLEXCAN_CTRL2_BTE_WIDTH
#define CAN_CTRL2_BTE(x)                FLEXCAN_CTRL2_BTE(x)

#define CAN_CTRL2_PREXCEN_MASK          FLEXCAN_CTRL2_PREXCEN_MASK
#define CAN_CTRL2_PREXCEN_SHIFT         FLEXCAN_CTRL2_PREXCEN_SHIFT
#define CAN_CTRL2_PREXCEN_WIDTH         FLEXCAN_CTRL2_PREXCEN_WIDTH
#define CAN_CTRL2_PREXCEN(x)            FLEXCAN_CTRL2_PREXCEN(x)

#define CAN_CTRL2_TIMER_SRC_MASK        FLEXCAN_CTRL2_TIMER_SRC_MASK
#define CAN_CTRL2_TIMER_SRC_SHIFT       FLEXCAN_CTRL2_TIMER_SRC_SHIFT
#define CAN_CTRL2_TIMER_SRC_WIDTH       FLEXCAN_CTRL2_TIMER_SRC_WIDTH
#define CAN_CTRL2_TIMER_SRC(x)          FLEXCAN_CTRL2_TIMER_SRC(x)

