zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K566/S32K566_device.h
#define CAN_CTRL2_EACEN_MASK            FLEXCAN_CTRL2_EACEN_MASK
#define CAN_CTRL2_EACEN_SHIFT           FLEXCAN_CTRL2_EACEN_SHIFT
#define CAN_CTRL2_EACEN_WIDTH           FLEXCAN_CTRL2_EACEN_WIDTH
#define CAN_CTRL2_EACEN(x)              FLEXCAN_CTRL2_EACEN(x)

#define CAN_CTRL2_RRS_MASK              FLEXCAN_CTRL2_RRS_MASK
#define CAN_CTRL2_RRS_SHIFT             FLEXCAN_CTRL2_RRS_SHIFT
#define CAN_CTRL2_RRS_WIDTH             FLEXCAN_CTRL2_RRS_WIDTH
#define CAN_CTRL2_RRS(x)                FLEXCAN_CTRL2_RRS(x)

#define CAN_CTRL2_MRP_MASK              FLEXCAN_CTRL2_MRP_MASK
#define CAN_CTRL2_MRP_SHIFT             FLEXCAN_CTRL2_MRP_SHIFT
#define CAN_CTRL2_MRP_WIDTH             FLEXCAN_CTRL2_MRP_WIDTH
#define CAN_CTRL2_MRP(x)                FLEXCAN_CTRL2_MRP(x)

#define CAN_CTRL2_TASD_MASK             FLEXCAN_CTRL2_TASD_MASK
#define CAN_CTRL2_TASD_SHIFT            FLEXCAN_CTRL2_TASD_SHIFT
#define CAN_CTRL2_TASD_WIDTH            FLEXCAN_CTRL2_TASD_WIDTH
#define CAN_CTRL2_TASD(x)               FLEXCAN_CTRL2_TASD(x)

#define CAN_CTRL2_RFFN_MASK             FLEXCAN_CTRL2_RFFN_MASK
#define CAN_CTRL2_RFFN_SHIFT            FLEXCAN_CTRL2_RFFN_SHIFT
#define CAN_CTRL2_RFFN_WIDTH            FLEXCAN_CTRL2_RFFN_WIDTH
#define CAN_CTRL2_RFFN(x)               FLEXCAN_CTRL2_RFFN(x)

#define CAN_CTRL2_WRMFRZ_MASK           FLEXCAN_CTRL2_WRMFRZ_MASK
#define CAN_CTRL2_WRMFRZ_SHIFT          FLEXCAN_CTRL2_WRMFRZ_SHIFT
#define CAN_CTRL2_WRMFRZ_WIDTH          FLEXCAN_CTRL2_WRMFRZ_WIDTH
#define CAN_CTRL2_WRMFRZ(x)             FLEXCAN_CTRL2_WRMFRZ(x)

#define CAN_CTRL2_ECRWRE_MASK           FLEXCAN_CTRL2_ECRWRE_MASK
#define CAN_CTRL2_ECRWRE_SHIFT          FLEXCAN_CTRL2_ECRWRE_SHIFT
#define CAN_CTRL2_ECRWRE_WIDTH          FLEXCAN_CTRL2_ECRWRE_WIDTH
#define CAN_CTRL2_ECRWRE(x)             FLEXCAN_CTRL2_ECRWRE(x)

#define CAN_CTRL2_BOFFDONEMSK_MASK      FLEXCAN_CTRL2_BOFFDONEMSK_MASK
#define CAN_CTRL2_BOFFDONEMSK_SHIFT     FLEXCAN_CTRL2_BOFFDONEMSK_SHIFT
#define CAN_CTRL2_BOFFDONEMSK_WIDTH     FLEXCAN_CTRL2_BOFFDONEMSK_WIDTH
#define CAN_CTRL2_BOFFDONEMSK(x)        FLEXCAN_CTRL2_BOFFDONEMSK(x)

#define CAN_CTRL2_ERRMSK_FAST_MASK      FLEXCAN_CTRL2_ERRMSK_FAST_MASK
#define CAN_CTRL2_ERRMSK_FAST_SHIFT     FLEXCAN_CTRL2_ERRMSK_FAST_SHIFT
#define CAN_CTRL2_ERRMSK_FAST_WIDTH     FLEXCAN_CTRL2_ERRMSK_FAST_WIDTH
#define CAN_CTRL2_ERRMSK_FAST(x)        FLEXCAN_CTRL2_ERRMSK_FAST(x)
/*! @} */

/*! @name ESR2 - Error and Status 2 */
/*! @{ */

#define CAN_ESR2_RX_PIN_ST_MASK         FLEXCAN_ESR2_RX_PIN_ST_MASK
#define CAN_ESR2_RX_PIN_ST_SHIFT        FLEXCAN_ESR2_RX_PIN_ST_SHIFT
#define CAN_ESR2_RX_PIN_ST_WIDTH        FLEXCAN_ESR2_RX_PIN_ST_WIDTH
#define CAN_ESR2_RX_PIN_ST(x)           FLEXCAN_ESR2_RX_PIN_ST(x)

#define CAN_ESR2_IMB_MASK               FLEXCAN_ESR2_IMB_MASK
#define CAN_ESR2_IMB_SHIFT              FLEXCAN_ESR2_IMB_SHIFT
#define CAN_ESR2_IMB_WIDTH              FLEXCAN_ESR2_IMB_WIDTH
#define CAN_ESR2_IMB(x)                 FLEXCAN_ESR2_IMB(x)

#define CAN_ESR2_VPS_MASK               FLEXCAN_ESR2_VPS_MASK
#define CAN_ESR2_VPS_SHIFT              FLEXCAN_ESR2_VPS_SHIFT
#define CAN_ESR2_VPS_WIDTH              FLEXCAN_ESR2_VPS_WIDTH
#define CAN_ESR2_VPS(x)                 FLEXCAN_ESR2_VPS(x)

#define CAN_ESR2_LPTM_MASK              FLEXCAN_ESR2_LPTM_MASK
#define CAN_ESR2_LPTM_SHIFT             FLEXCAN_ESR2_LPTM_SHIFT
#define CAN_ESR2_LPTM_WIDTH             FLEXCAN_ESR2_LPTM_WIDTH
#define CAN_ESR2_LPTM(x)                FLEXCAN_ESR2_LPTM(x)
/*! @} */

/*! @name CRCR - Cyclic Redundancy Check */
/*! @{ */

#define CAN_CRCR_TXCRC_MASK             FLEXCAN_CRCR_TXCRC_MASK
#define CAN_CRCR_TXCRC_SHIFT            FLEXCAN_CRCR_TXCRC_SHIFT
#define CAN_CRCR_TXCRC_WIDTH            FLEXCAN_CRCR_TXCRC_WIDTH
#define CAN_CRCR_TXCRC(x)               FLEXCAN_CRCR_TXCRC(x)

#define CAN_CRCR_MBCRC_MASK             FLEXCAN_CRCR_MBCRC_MASK
#define CAN_CRCR_MBCRC_SHIFT            FLEXCAN_CRCR_MBCRC_SHIFT
#define CAN_CRCR_MBCRC_WIDTH            FLEXCAN_CRCR_MBCRC_WIDTH
#define CAN_CRCR_MBCRC(x)               FLEXCAN_CRCR_MBCRC(x)
/*! @} */

/*! @name RXFGMASK - Legacy RX FIFO Global Mask */
/*! @{ */

#define CAN_RXFGMASK_FGM_MASK           FLEXCAN_RXFGMASK_FGM_MASK
#define CAN_RXFGMASK_FGM_SHIFT          FLEXCAN_RXFGMASK_FGM_SHIFT
#define CAN_RXFGMASK_FGM_WIDTH          FLEXCAN_RXFGMASK_FGM_WIDTH
#define CAN_RXFGMASK_FGM(x)             FLEXCAN_RXFGMASK_FGM(x)
/*! @} */

/*! @name RXFIR - Legacy RX FIFO Information */
/*! @{ */

#define CAN_RXFIR_IDHIT_MASK            FLEXCAN_RXFIR_IDHIT_MASK
#define CAN_RXFIR_IDHIT_SHIFT           FLEXCAN_RXFIR_IDHIT_SHIFT
#define CAN_RXFIR_IDHIT_WIDTH           FLEXCAN_RXFIR_IDHIT_WIDTH
#define CAN_RXFIR_IDHIT(x)              FLEXCAN_RXFIR_IDHIT(x)
/*! @} */

/*! @name CBT - CAN Bit Timing */
/*! @{ */

#define CAN_CBT_EPSEG2_MASK             FLEXCAN_CBT_EPSEG2_MASK
#define CAN_CBT_EPSEG2_SHIFT            FLEXCAN_CBT_EPSEG2_SHIFT
#define CAN_CBT_EPSEG2_WIDTH            FLEXCAN_CBT_EPSEG2_WIDTH
#define CAN_CBT_EPSEG2(x)               FLEXCAN_CBT_EPSEG2(x)

#define CAN_CBT_EPSEG1_MASK             FLEXCAN_CBT_EPSEG1_MASK
#define CAN_CBT_EPSEG1_SHIFT            FLEXCAN_CBT_EPSEG1_SHIFT
#define CAN_CBT_EPSEG1_WIDTH            FLEXCAN_CBT_EPSEG1_WIDTH
#define CAN_CBT_EPSEG1(x)               FLEXCAN_CBT_EPSEG1(x)

#define CAN_CBT_EPROPSEG_MASK           FLEXCAN_CBT_EPROPSEG_MASK
#define CAN_CBT_EPROPSEG_SHIFT          FLEXCAN_CBT_EPROPSEG_SHIFT
#define CAN_CBT_EPROPSEG_WIDTH          FLEXCAN_CBT_EPROPSEG_WIDTH
#define CAN_CBT_EPROPSEG(x)             FLEXCAN_CBT_EPROPSEG(x)

#define CAN_CBT_ERJW_MASK               FLEXCAN_CBT_ERJW_MASK
#define CAN_CBT_ERJW_SHIFT              FLEXCAN_CBT_ERJW_SHIFT
#define CAN_CBT_ERJW_WIDTH              FLEXCAN_CBT_ERJW_WIDTH
#define CAN_CBT_ERJW(x)                 FLEXCAN_CBT_ERJW(x)

#define CAN_CBT_EPRESDIV_MASK           FLEXCAN_CBT_EPRESDIV_MASK
#define CAN_CBT_EPRESDIV_SHIFT          FLEXCAN_CBT_EPRESDIV_SHIFT
#define CAN_CBT_EPRESDIV_WIDTH          FLEXCAN_CBT_EPRESDIV_WIDTH
#define CAN_CBT_EPRESDIV(x)             FLEXCAN_CBT_EPRESDIV(x)

#define CAN_CBT_BTF_MASK                FLEXCAN_CBT_BTF_MASK
#define CAN_CBT_BTF_SHIFT               FLEXCAN_CBT_BTF_SHIFT
#define CAN_CBT_BTF_WIDTH               FLEXCAN_CBT_BTF_WIDTH
#define CAN_CBT_BTF(x)                  FLEXCAN_CBT_BTF(x)
/*! @} */

