zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K566/S32K566_device.h
/*! @name IMASK3 - Interrupt Masks 3 */
/*! @{ */

#define CAN_IMASK3_BUF95TO64M_MASK      FLEXCAN_IMASK3_BUF95TO64M_MASK
#define CAN_IMASK3_BUF95TO64M_SHIFT     FLEXCAN_IMASK3_BUF95TO64M_SHIFT
#define CAN_IMASK3_BUF95TO64M_WIDTH     FLEXCAN_IMASK3_BUF95TO64M_WIDTH
#define CAN_IMASK3_BUF95TO64M(x)        FLEXCAN_IMASK3_BUF95TO64M(x)
/*! @} */

/*! @name IFLAG3 - Interrupt Flags 3 */
/*! @{ */

#define CAN_IFLAG3_BUF95TO64_MASK       FLEXCAN_IFLAG3_BUF95TO64_MASK
#define CAN_IFLAG3_BUF95TO64_SHIFT      FLEXCAN_IFLAG3_BUF95TO64_SHIFT
#define CAN_IFLAG3_BUF95TO64_WIDTH      FLEXCAN_IFLAG3_BUF95TO64_WIDTH
#define CAN_IFLAG3_BUF95TO64(x)         FLEXCAN_IFLAG3_BUF95TO64(x)
/*! @} */

/*! @name ET - External Timer */
/*! @{ */

#define CAN_ET_TIMER_MASK               FLEXCAN_ET_TIMER_MASK
#define CAN_ET_TIMER_SHIFT              FLEXCAN_ET_TIMER_SHIFT
#define CAN_ET_TIMER_WIDTH              FLEXCAN_ET_TIMER_WIDTH
#define CAN_ET_TIMER(x)                 FLEXCAN_ET_TIMER(x)
/*! @} */

/*! @name FLTCONF_IE - Fault Confinement Interrupt Enable */
/*! @{ */

#define CAN_FLTCONF_IE_ATP_IE_MASK      FLEXCAN_FLTCONF_IE_ATP_IE_MASK
#define CAN_FLTCONF_IE_ATP_IE_SHIFT     FLEXCAN_FLTCONF_IE_ATP_IE_SHIFT
#define CAN_FLTCONF_IE_ATP_IE_WIDTH     FLEXCAN_FLTCONF_IE_ATP_IE_WIDTH
#define CAN_FLTCONF_IE_ATP_IE(x)        FLEXCAN_FLTCONF_IE_ATP_IE(x)

#define CAN_FLTCONF_IE_PTA_IE_MASK      FLEXCAN_FLTCONF_IE_PTA_IE_MASK
#define CAN_FLTCONF_IE_PTA_IE_SHIFT     FLEXCAN_FLTCONF_IE_PTA_IE_SHIFT
#define CAN_FLTCONF_IE_PTA_IE_WIDTH     FLEXCAN_FLTCONF_IE_PTA_IE_WIDTH
#define CAN_FLTCONF_IE_PTA_IE(x)        FLEXCAN_FLTCONF_IE_PTA_IE(x)
/*! @} */

/*! @name RXIMR - Receive Individual Mask */
/*! @{ */

#define CAN_RXIMR_MI_MASK               FLEXCAN_RXIMR_MI_MASK
#define CAN_RXIMR_MI_SHIFT              FLEXCAN_RXIMR_MI_SHIFT
#define CAN_RXIMR_MI_WIDTH              FLEXCAN_RXIMR_MI_WIDTH
#define CAN_RXIMR_MI(x)                 FLEXCAN_RXIMR_MI(x)
/*! @} */

/*! @name MECR - Memory Error Control */
/*! @{ */

#define CAN_MECR_NCEFAFRZ_MASK          FLEXCAN_MECR_NCEFAFRZ_MASK
#define CAN_MECR_NCEFAFRZ_SHIFT         FLEXCAN_MECR_NCEFAFRZ_SHIFT
#define CAN_MECR_NCEFAFRZ_WIDTH         FLEXCAN_MECR_NCEFAFRZ_WIDTH
#define CAN_MECR_NCEFAFRZ(x)            FLEXCAN_MECR_NCEFAFRZ(x)

#define CAN_MECR_ECCDIS_MASK            FLEXCAN_MECR_ECCDIS_MASK
#define CAN_MECR_ECCDIS_SHIFT           FLEXCAN_MECR_ECCDIS_SHIFT
#define CAN_MECR_ECCDIS_WIDTH           FLEXCAN_MECR_ECCDIS_WIDTH
#define CAN_MECR_ECCDIS(x)              FLEXCAN_MECR_ECCDIS(x)

#define CAN_MECR_RERRDIS_MASK           FLEXCAN_MECR_RERRDIS_MASK
#define CAN_MECR_RERRDIS_SHIFT          FLEXCAN_MECR_RERRDIS_SHIFT
#define CAN_MECR_RERRDIS_WIDTH          FLEXCAN_MECR_RERRDIS_WIDTH
#define CAN_MECR_RERRDIS(x)             FLEXCAN_MECR_RERRDIS(x)

#define CAN_MECR_EXTERRIE_MASK          FLEXCAN_MECR_EXTERRIE_MASK
#define CAN_MECR_EXTERRIE_SHIFT         FLEXCAN_MECR_EXTERRIE_SHIFT
#define CAN_MECR_EXTERRIE_WIDTH         FLEXCAN_MECR_EXTERRIE_WIDTH
#define CAN_MECR_EXTERRIE(x)            FLEXCAN_MECR_EXTERRIE(x)

#define CAN_MECR_FAERRIE_MASK           FLEXCAN_MECR_FAERRIE_MASK
#define CAN_MECR_FAERRIE_SHIFT          FLEXCAN_MECR_FAERRIE_SHIFT
#define CAN_MECR_FAERRIE_WIDTH          FLEXCAN_MECR_FAERRIE_WIDTH
#define CAN_MECR_FAERRIE(x)             FLEXCAN_MECR_FAERRIE(x)

#define CAN_MECR_HAERRIE_MASK           FLEXCAN_MECR_HAERRIE_MASK
#define CAN_MECR_HAERRIE_SHIFT          FLEXCAN_MECR_HAERRIE_SHIFT
#define CAN_MECR_HAERRIE_WIDTH          FLEXCAN_MECR_HAERRIE_WIDTH
#define CAN_MECR_HAERRIE(x)             FLEXCAN_MECR_HAERRIE(x)

#define CAN_MECR_ECRWRDIS_MASK          FLEXCAN_MECR_ECRWRDIS_MASK
#define CAN_MECR_ECRWRDIS_SHIFT         FLEXCAN_MECR_ECRWRDIS_SHIFT
#define CAN_MECR_ECRWRDIS_WIDTH         FLEXCAN_MECR_ECRWRDIS_WIDTH
#define CAN_MECR_ECRWRDIS(x)            FLEXCAN_MECR_ECRWRDIS(x)
/*! @} */

/*! @name ERRIAR - Error Injection Address */
/*! @{ */

#define CAN_ERRIAR_INJADDR_L_MASK       FLEXCAN_ERRIAR_INJADDR_L_MASK
#define CAN_ERRIAR_INJADDR_L_SHIFT      FLEXCAN_ERRIAR_INJADDR_L_SHIFT
#define CAN_ERRIAR_INJADDR_L_WIDTH      FLEXCAN_ERRIAR_INJADDR_L_WIDTH
#define CAN_ERRIAR_INJADDR_L(x)         FLEXCAN_ERRIAR_INJADDR_L(x)

#define CAN_ERRIAR_INJADDR_H_MASK       FLEXCAN_ERRIAR_INJADDR_H_MASK
#define CAN_ERRIAR_INJADDR_H_SHIFT      FLEXCAN_ERRIAR_INJADDR_H_SHIFT
#define CAN_ERRIAR_INJADDR_H_WIDTH      FLEXCAN_ERRIAR_INJADDR_H_WIDTH
#define CAN_ERRIAR_INJADDR_H(x)         FLEXCAN_ERRIAR_INJADDR_H(x)
/*! @} */

/*! @name ERRIDPR - Error Injection Data Pattern */
/*! @{ */

#define CAN_ERRIDPR_DFLIP_MASK          FLEXCAN_ERRIDPR_DFLIP_MASK
#define CAN_ERRIDPR_DFLIP_SHIFT         FLEXCAN_ERRIDPR_DFLIP_SHIFT
#define CAN_ERRIDPR_DFLIP_WIDTH         FLEXCAN_ERRIDPR_DFLIP_WIDTH
#define CAN_ERRIDPR_DFLIP(x)            FLEXCAN_ERRIDPR_DFLIP(x)
/*! @} */

/*! @name ERRIPPR - Error Injection Parity Pattern */
/*! @{ */

#define CAN_ERRIPPR_PFLIP0_MASK         FLEXCAN_ERRIPPR_PFLIP0_MASK
#define CAN_ERRIPPR_PFLIP0_SHIFT        FLEXCAN_ERRIPPR_PFLIP0_SHIFT
#define CAN_ERRIPPR_PFLIP0_WIDTH        FLEXCAN_ERRIPPR_PFLIP0_WIDTH
#define CAN_ERRIPPR_PFLIP0(x)           FLEXCAN_ERRIPPR_PFLIP0(x)

#define CAN_ERRIPPR_PFLIP1_MASK         FLEXCAN_ERRIPPR_PFLIP1_MASK
#define CAN_ERRIPPR_PFLIP1_SHIFT        FLEXCAN_ERRIPPR_PFLIP1_SHIFT
#define CAN_ERRIPPR_PFLIP1_WIDTH        FLEXCAN_ERRIPPR_PFLIP1_WIDTH
#define CAN_ERRIPPR_PFLIP1(x)           FLEXCAN_ERRIPPR_PFLIP1(x)

#define CAN_ERRIPPR_PFLIP2_MASK         FLEXCAN_ERRIPPR_PFLIP2_MASK
#define CAN_ERRIPPR_PFLIP2_SHIFT        FLEXCAN_ERRIPPR_PFLIP2_SHIFT
#define CAN_ERRIPPR_PFLIP2_WIDTH        FLEXCAN_ERRIPPR_PFLIP2_WIDTH
#define CAN_ERRIPPR_PFLIP2(x)           FLEXCAN_ERRIPPR_PFLIP2(x)

#define CAN_ERRIPPR_PFLIP3_MASK         FLEXCAN_ERRIPPR_PFLIP3_MASK
#define CAN_ERRIPPR_PFLIP3_SHIFT        FLEXCAN_ERRIPPR_PFLIP3_SHIFT
#define CAN_ERRIPPR_PFLIP3_WIDTH        FLEXCAN_ERRIPPR_PFLIP3_WIDTH
#define CAN_ERRIPPR_PFLIP3(x)           FLEXCAN_ERRIPPR_PFLIP3(x)
/*! @} */

/*! @name RERRAR - Error Report Address */
/*! @{ */

#define CAN_RERRAR_ERRADDR_MASK         FLEXCAN_RERRAR_ERRADDR_MASK
#define CAN_RERRAR_ERRADDR_SHIFT        FLEXCAN_RERRAR_ERRADDR_SHIFT
#define CAN_RERRAR_ERRADDR_WIDTH        FLEXCAN_RERRAR_ERRADDR_WIDTH
#define CAN_RERRAR_ERRADDR(x)           FLEXCAN_RERRAR_ERRADDR(x)

#define CAN_RERRAR_SAID_MASK            FLEXCAN_RERRAR_SAID_MASK
#define CAN_RERRAR_SAID_SHIFT           FLEXCAN_RERRAR_SAID_SHIFT
#define CAN_RERRAR_SAID_WIDTH           FLEXCAN_RERRAR_SAID_WIDTH
#define CAN_RERRAR_SAID(x)              FLEXCAN_RERRAR_SAID(x)

#define CAN_RERRAR_NCE_MASK             FLEXCAN_RERRAR_NCE_MASK
#define CAN_RERRAR_NCE_SHIFT            FLEXCAN_RERRAR_NCE_SHIFT
#define CAN_RERRAR_NCE_WIDTH            FLEXCAN_RERRAR_NCE_WIDTH
#define CAN_RERRAR_NCE(x)               FLEXCAN_RERRAR_NCE(x)
/*! @} */

/*! @name RERRDR - Error Report Data */
/*! @{ */

#define CAN_RERRDR_RDATA_MASK           FLEXCAN_RERRDR_RDATA_MASK
#define CAN_RERRDR_RDATA_SHIFT          FLEXCAN_RERRDR_RDATA_SHIFT
#define CAN_RERRDR_RDATA_WIDTH          FLEXCAN_RERRDR_RDATA_WIDTH
#define CAN_RERRDR_RDATA(x)             FLEXCAN_RERRDR_RDATA(x)
/*! @} */

/*! @name RERRSYNR - Error Report Syndrome */
/*! @{ */

