zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K566/S32K566_device.h
#define CAN_RERRSYNR_SYND0_MASK         FLEXCAN_RERRSYNR_SYND0_MASK
#define CAN_RERRSYNR_SYND0_SHIFT        FLEXCAN_RERRSYNR_SYND0_SHIFT
#define CAN_RERRSYNR_SYND0_WIDTH        FLEXCAN_RERRSYNR_SYND0_WIDTH
#define CAN_RERRSYNR_SYND0(x)           FLEXCAN_RERRSYNR_SYND0(x)

#define CAN_RERRSYNR_BE0_MASK           FLEXCAN_RERRSYNR_BE0_MASK
#define CAN_RERRSYNR_BE0_SHIFT          FLEXCAN_RERRSYNR_BE0_SHIFT
#define CAN_RERRSYNR_BE0_WIDTH          FLEXCAN_RERRSYNR_BE0_WIDTH
#define CAN_RERRSYNR_BE0(x)             FLEXCAN_RERRSYNR_BE0(x)

#define CAN_RERRSYNR_SYND1_MASK         FLEXCAN_RERRSYNR_SYND1_MASK
#define CAN_RERRSYNR_SYND1_SHIFT        FLEXCAN_RERRSYNR_SYND1_SHIFT
#define CAN_RERRSYNR_SYND1_WIDTH        FLEXCAN_RERRSYNR_SYND1_WIDTH
#define CAN_RERRSYNR_SYND1(x)           FLEXCAN_RERRSYNR_SYND1(x)

#define CAN_RERRSYNR_BE1_MASK           FLEXCAN_RERRSYNR_BE1_MASK
#define CAN_RERRSYNR_BE1_SHIFT          FLEXCAN_RERRSYNR_BE1_SHIFT
#define CAN_RERRSYNR_BE1_WIDTH          FLEXCAN_RERRSYNR_BE1_WIDTH
#define CAN_RERRSYNR_BE1(x)             FLEXCAN_RERRSYNR_BE1(x)

#define CAN_RERRSYNR_SYND2_MASK         FLEXCAN_RERRSYNR_SYND2_MASK
#define CAN_RERRSYNR_SYND2_SHIFT        FLEXCAN_RERRSYNR_SYND2_SHIFT
#define CAN_RERRSYNR_SYND2_WIDTH        FLEXCAN_RERRSYNR_SYND2_WIDTH
#define CAN_RERRSYNR_SYND2(x)           FLEXCAN_RERRSYNR_SYND2(x)

#define CAN_RERRSYNR_BE2_MASK           FLEXCAN_RERRSYNR_BE2_MASK
#define CAN_RERRSYNR_BE2_SHIFT          FLEXCAN_RERRSYNR_BE2_SHIFT
#define CAN_RERRSYNR_BE2_WIDTH          FLEXCAN_RERRSYNR_BE2_WIDTH
#define CAN_RERRSYNR_BE2(x)             FLEXCAN_RERRSYNR_BE2(x)

#define CAN_RERRSYNR_SYND3_MASK         FLEXCAN_RERRSYNR_SYND3_MASK
#define CAN_RERRSYNR_SYND3_SHIFT        FLEXCAN_RERRSYNR_SYND3_SHIFT
#define CAN_RERRSYNR_SYND3_WIDTH        FLEXCAN_RERRSYNR_SYND3_WIDTH
#define CAN_RERRSYNR_SYND3(x)           FLEXCAN_RERRSYNR_SYND3(x)

#define CAN_RERRSYNR_BE3_MASK           FLEXCAN_RERRSYNR_BE3_MASK
#define CAN_RERRSYNR_BE3_SHIFT          FLEXCAN_RERRSYNR_BE3_SHIFT
#define CAN_RERRSYNR_BE3_WIDTH          FLEXCAN_RERRSYNR_BE3_WIDTH
#define CAN_RERRSYNR_BE3(x)             FLEXCAN_RERRSYNR_BE3(x)
/*! @} */

/*! @name ERRSR - Error Status */
/*! @{ */

#define CAN_ERRSR_CEIOF_MASK            FLEXCAN_ERRSR_CEIOF_MASK
#define CAN_ERRSR_CEIOF_SHIFT           FLEXCAN_ERRSR_CEIOF_SHIFT
#define CAN_ERRSR_CEIOF_WIDTH           FLEXCAN_ERRSR_CEIOF_WIDTH
#define CAN_ERRSR_CEIOF(x)              FLEXCAN_ERRSR_CEIOF(x)

#define CAN_ERRSR_FANCEIOF_MASK         FLEXCAN_ERRSR_FANCEIOF_MASK
#define CAN_ERRSR_FANCEIOF_SHIFT        FLEXCAN_ERRSR_FANCEIOF_SHIFT
#define CAN_ERRSR_FANCEIOF_WIDTH        FLEXCAN_ERRSR_FANCEIOF_WIDTH
#define CAN_ERRSR_FANCEIOF(x)           FLEXCAN_ERRSR_FANCEIOF(x)

#define CAN_ERRSR_HANCEIOF_MASK         FLEXCAN_ERRSR_HANCEIOF_MASK
#define CAN_ERRSR_HANCEIOF_SHIFT        FLEXCAN_ERRSR_HANCEIOF_SHIFT
#define CAN_ERRSR_HANCEIOF_WIDTH        FLEXCAN_ERRSR_HANCEIOF_WIDTH
#define CAN_ERRSR_HANCEIOF(x)           FLEXCAN_ERRSR_HANCEIOF(x)

#define CAN_ERRSR_CEIF_MASK             FLEXCAN_ERRSR_CEIF_MASK
#define CAN_ERRSR_CEIF_SHIFT            FLEXCAN_ERRSR_CEIF_SHIFT
#define CAN_ERRSR_CEIF_WIDTH            FLEXCAN_ERRSR_CEIF_WIDTH
#define CAN_ERRSR_CEIF(x)               FLEXCAN_ERRSR_CEIF(x)

#define CAN_ERRSR_FANCEIF_MASK          FLEXCAN_ERRSR_FANCEIF_MASK
#define CAN_ERRSR_FANCEIF_SHIFT         FLEXCAN_ERRSR_FANCEIF_SHIFT
#define CAN_ERRSR_FANCEIF_WIDTH         FLEXCAN_ERRSR_FANCEIF_WIDTH
#define CAN_ERRSR_FANCEIF(x)            FLEXCAN_ERRSR_FANCEIF(x)

#define CAN_ERRSR_HANCEIF_MASK          FLEXCAN_ERRSR_HANCEIF_MASK
#define CAN_ERRSR_HANCEIF_SHIFT         FLEXCAN_ERRSR_HANCEIF_SHIFT
#define CAN_ERRSR_HANCEIF_WIDTH         FLEXCAN_ERRSR_HANCEIF_WIDTH
#define CAN_ERRSR_HANCEIF(x)            FLEXCAN_ERRSR_HANCEIF(x)
/*! @} */

/*! @name EPRS - Enhanced CAN Bit Timing Prescalers */
/*! @{ */

#define CAN_EPRS_ENPRESDIV_MASK         FLEXCAN_EPRS_ENPRESDIV_MASK
#define CAN_EPRS_ENPRESDIV_SHIFT        FLEXCAN_EPRS_ENPRESDIV_SHIFT
#define CAN_EPRS_ENPRESDIV_WIDTH        FLEXCAN_EPRS_ENPRESDIV_WIDTH
#define CAN_EPRS_ENPRESDIV(x)           FLEXCAN_EPRS_ENPRESDIV(x)

#define CAN_EPRS_EDPRESDIV_MASK         FLEXCAN_EPRS_EDPRESDIV_MASK
#define CAN_EPRS_EDPRESDIV_SHIFT        FLEXCAN_EPRS_EDPRESDIV_SHIFT
#define CAN_EPRS_EDPRESDIV_WIDTH        FLEXCAN_EPRS_EDPRESDIV_WIDTH
#define CAN_EPRS_EDPRESDIV(x)           FLEXCAN_EPRS_EDPRESDIV(x)
/*! @} */

/*! @name ENCBT - Enhanced Nominal CAN Bit Timing */
/*! @{ */

#define CAN_ENCBT_NTSEG1_MASK           FLEXCAN_ENCBT_NTSEG1_MASK
#define CAN_ENCBT_NTSEG1_SHIFT          FLEXCAN_ENCBT_NTSEG1_SHIFT
#define CAN_ENCBT_NTSEG1_WIDTH          FLEXCAN_ENCBT_NTSEG1_WIDTH
#define CAN_ENCBT_NTSEG1(x)             FLEXCAN_ENCBT_NTSEG1(x)

#define CAN_ENCBT_NTSEG2_MASK           FLEXCAN_ENCBT_NTSEG2_MASK
#define CAN_ENCBT_NTSEG2_SHIFT          FLEXCAN_ENCBT_NTSEG2_SHIFT
#define CAN_ENCBT_NTSEG2_WIDTH          FLEXCAN_ENCBT_NTSEG2_WIDTH
#define CAN_ENCBT_NTSEG2(x)             FLEXCAN_ENCBT_NTSEG2(x)

#define CAN_ENCBT_NRJW_MASK             FLEXCAN_ENCBT_NRJW_MASK
#define CAN_ENCBT_NRJW_SHIFT            FLEXCAN_ENCBT_NRJW_SHIFT
#define CAN_ENCBT_NRJW_WIDTH            FLEXCAN_ENCBT_NRJW_WIDTH
#define CAN_ENCBT_NRJW(x)               FLEXCAN_ENCBT_NRJW(x)
/*! @} */

/*! @name EDCBT - Enhanced Data Phase CAN Bit Timing */
/*! @{ */

#define CAN_EDCBT_DTSEG1_MASK           FLEXCAN_EDCBT_DTSEG1_MASK
#define CAN_EDCBT_DTSEG1_SHIFT          FLEXCAN_EDCBT_DTSEG1_SHIFT
#define CAN_EDCBT_DTSEG1_WIDTH          FLEXCAN_EDCBT_DTSEG1_WIDTH
#define CAN_EDCBT_DTSEG1(x)             FLEXCAN_EDCBT_DTSEG1(x)

#define CAN_EDCBT_DTSEG2_MASK           FLEXCAN_EDCBT_DTSEG2_MASK
#define CAN_EDCBT_DTSEG2_SHIFT          FLEXCAN_EDCBT_DTSEG2_SHIFT
#define CAN_EDCBT_DTSEG2_WIDTH          FLEXCAN_EDCBT_DTSEG2_WIDTH
#define CAN_EDCBT_DTSEG2(x)             FLEXCAN_EDCBT_DTSEG2(x)

#define CAN_EDCBT_DRJW_MASK             FLEXCAN_EDCBT_DRJW_MASK
#define CAN_EDCBT_DRJW_SHIFT            FLEXCAN_EDCBT_DRJW_SHIFT
#define CAN_EDCBT_DRJW_WIDTH            FLEXCAN_EDCBT_DRJW_WIDTH
#define CAN_EDCBT_DRJW(x)               FLEXCAN_EDCBT_DRJW(x)
/*! @} */

/*! @name ETDC - Enhanced Transceiver Delay Compensation */
/*! @{ */

#define CAN_ETDC_ETDCVAL_MASK           FLEXCAN_ETDC_ETDCVAL_MASK
#define CAN_ETDC_ETDCVAL_SHIFT          FLEXCAN_ETDC_ETDCVAL_SHIFT
#define CAN_ETDC_ETDCVAL_WIDTH          FLEXCAN_ETDC_ETDCVAL_WIDTH
#define CAN_ETDC_ETDCVAL(x)             FLEXCAN_ETDC_ETDCVAL(x)

#define CAN_ETDC_ETDCFAIL_MASK          FLEXCAN_ETDC_ETDCFAIL_MASK
#define CAN_ETDC_ETDCFAIL_SHIFT         FLEXCAN_ETDC_ETDCFAIL_SHIFT
#define CAN_ETDC_ETDCFAIL_WIDTH         FLEXCAN_ETDC_ETDCFAIL_WIDTH
#define CAN_ETDC_ETDCFAIL(x)            FLEXCAN_ETDC_ETDCFAIL(x)

