zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K566/S32K566_device.h
#define CAN_ETDC_ETDCOFF_MASK           FLEXCAN_ETDC_ETDCOFF_MASK
#define CAN_ETDC_ETDCOFF_SHIFT          FLEXCAN_ETDC_ETDCOFF_SHIFT
#define CAN_ETDC_ETDCOFF_WIDTH          FLEXCAN_ETDC_ETDCOFF_WIDTH
#define CAN_ETDC_ETDCOFF(x)             FLEXCAN_ETDC_ETDCOFF(x)

#define CAN_ETDC_TDMDIS_MASK            FLEXCAN_ETDC_TDMDIS_MASK
#define CAN_ETDC_TDMDIS_SHIFT           FLEXCAN_ETDC_TDMDIS_SHIFT
#define CAN_ETDC_TDMDIS_WIDTH           FLEXCAN_ETDC_TDMDIS_WIDTH
#define CAN_ETDC_TDMDIS(x)              FLEXCAN_ETDC_TDMDIS(x)

#define CAN_ETDC_ETDCEN_MASK            FLEXCAN_ETDC_ETDCEN_MASK
#define CAN_ETDC_ETDCEN_SHIFT           FLEXCAN_ETDC_ETDCEN_SHIFT
#define CAN_ETDC_ETDCEN_WIDTH           FLEXCAN_ETDC_ETDCEN_WIDTH
#define CAN_ETDC_ETDCEN(x)              FLEXCAN_ETDC_ETDCEN(x)
/*! @} */

/*! @name FDCTRL - CAN FD Control */
/*! @{ */

#define CAN_FDCTRL_TDCVAL_MASK          FLEXCAN_FDCTRL_TDCVAL_MASK
#define CAN_FDCTRL_TDCVAL_SHIFT         FLEXCAN_FDCTRL_TDCVAL_SHIFT
#define CAN_FDCTRL_TDCVAL_WIDTH         FLEXCAN_FDCTRL_TDCVAL_WIDTH
#define CAN_FDCTRL_TDCVAL(x)            FLEXCAN_FDCTRL_TDCVAL(x)

#define CAN_FDCTRL_TDCOFF_MASK          FLEXCAN_FDCTRL_TDCOFF_MASK
#define CAN_FDCTRL_TDCOFF_SHIFT         FLEXCAN_FDCTRL_TDCOFF_SHIFT
#define CAN_FDCTRL_TDCOFF_WIDTH         FLEXCAN_FDCTRL_TDCOFF_WIDTH
#define CAN_FDCTRL_TDCOFF(x)            FLEXCAN_FDCTRL_TDCOFF(x)

#define CAN_FDCTRL_TDCFAIL_MASK         FLEXCAN_FDCTRL_TDCFAIL_MASK
#define CAN_FDCTRL_TDCFAIL_SHIFT        FLEXCAN_FDCTRL_TDCFAIL_SHIFT
#define CAN_FDCTRL_TDCFAIL_WIDTH        FLEXCAN_FDCTRL_TDCFAIL_WIDTH
#define CAN_FDCTRL_TDCFAIL(x)           FLEXCAN_FDCTRL_TDCFAIL(x)

#define CAN_FDCTRL_TDCEN_MASK           FLEXCAN_FDCTRL_TDCEN_MASK
#define CAN_FDCTRL_TDCEN_SHIFT          FLEXCAN_FDCTRL_TDCEN_SHIFT
#define CAN_FDCTRL_TDCEN_WIDTH          FLEXCAN_FDCTRL_TDCEN_WIDTH
#define CAN_FDCTRL_TDCEN(x)             FLEXCAN_FDCTRL_TDCEN(x)

#define CAN_FDCTRL_MBDSR0_MASK          FLEXCAN_FDCTRL_MBDSR0_MASK
#define CAN_FDCTRL_MBDSR0_SHIFT         FLEXCAN_FDCTRL_MBDSR0_SHIFT
#define CAN_FDCTRL_MBDSR0_WIDTH         FLEXCAN_FDCTRL_MBDSR0_WIDTH
#define CAN_FDCTRL_MBDSR0(x)            FLEXCAN_FDCTRL_MBDSR0(x)

#define CAN_FDCTRL_MBDSR1_MASK          FLEXCAN_FDCTRL_MBDSR1_MASK
#define CAN_FDCTRL_MBDSR1_SHIFT         FLEXCAN_FDCTRL_MBDSR1_SHIFT
#define CAN_FDCTRL_MBDSR1_WIDTH         FLEXCAN_FDCTRL_MBDSR1_WIDTH
#define CAN_FDCTRL_MBDSR1(x)            FLEXCAN_FDCTRL_MBDSR1(x)

#define CAN_FDCTRL_MBDSR2_MASK          FLEXCAN_FDCTRL_MBDSR2_MASK
#define CAN_FDCTRL_MBDSR2_SHIFT         FLEXCAN_FDCTRL_MBDSR2_SHIFT
#define CAN_FDCTRL_MBDSR2_WIDTH         FLEXCAN_FDCTRL_MBDSR2_WIDTH
#define CAN_FDCTRL_MBDSR2(x)            FLEXCAN_FDCTRL_MBDSR2(x)

#define CAN_FDCTRL_FDRATE_MASK          FLEXCAN_FDCTRL_FDRATE_MASK
#define CAN_FDCTRL_FDRATE_SHIFT         FLEXCAN_FDCTRL_FDRATE_SHIFT
#define CAN_FDCTRL_FDRATE_WIDTH         FLEXCAN_FDCTRL_FDRATE_WIDTH
#define CAN_FDCTRL_FDRATE(x)            FLEXCAN_FDCTRL_FDRATE(x)
/*! @} */

/*! @name FDCBT - CAN FD Bit Timing */
/*! @{ */

#define CAN_FDCBT_FPSEG2_MASK           FLEXCAN_FDCBT_FPSEG2_MASK
#define CAN_FDCBT_FPSEG2_SHIFT          FLEXCAN_FDCBT_FPSEG2_SHIFT
#define CAN_FDCBT_FPSEG2_WIDTH          FLEXCAN_FDCBT_FPSEG2_WIDTH
#define CAN_FDCBT_FPSEG2(x)             FLEXCAN_FDCBT_FPSEG2(x)

#define CAN_FDCBT_FPSEG1_MASK           FLEXCAN_FDCBT_FPSEG1_MASK
#define CAN_FDCBT_FPSEG1_SHIFT          FLEXCAN_FDCBT_FPSEG1_SHIFT
#define CAN_FDCBT_FPSEG1_WIDTH          FLEXCAN_FDCBT_FPSEG1_WIDTH
#define CAN_FDCBT_FPSEG1(x)             FLEXCAN_FDCBT_FPSEG1(x)

#define CAN_FDCBT_FPROPSEG_MASK         FLEXCAN_FDCBT_FPROPSEG_MASK
#define CAN_FDCBT_FPROPSEG_SHIFT        FLEXCAN_FDCBT_FPROPSEG_SHIFT
#define CAN_FDCBT_FPROPSEG_WIDTH        FLEXCAN_FDCBT_FPROPSEG_WIDTH
#define CAN_FDCBT_FPROPSEG(x)           FLEXCAN_FDCBT_FPROPSEG(x)

#define CAN_FDCBT_FRJW_MASK             FLEXCAN_FDCBT_FRJW_MASK
#define CAN_FDCBT_FRJW_SHIFT            FLEXCAN_FDCBT_FRJW_SHIFT
#define CAN_FDCBT_FRJW_WIDTH            FLEXCAN_FDCBT_FRJW_WIDTH
#define CAN_FDCBT_FRJW(x)               FLEXCAN_FDCBT_FRJW(x)

#define CAN_FDCBT_FPRESDIV_MASK         FLEXCAN_FDCBT_FPRESDIV_MASK
#define CAN_FDCBT_FPRESDIV_SHIFT        FLEXCAN_FDCBT_FPRESDIV_SHIFT
#define CAN_FDCBT_FPRESDIV_WIDTH        FLEXCAN_FDCBT_FPRESDIV_WIDTH
#define CAN_FDCBT_FPRESDIV(x)           FLEXCAN_FDCBT_FPRESDIV(x)
/*! @} */

/*! @name FDCRC - CAN FD CRC */
/*! @{ */

#define CAN_FDCRC_FD_TXCRC_MASK         FLEXCAN_FDCRC_FD_TXCRC_MASK
#define CAN_FDCRC_FD_TXCRC_SHIFT        FLEXCAN_FDCRC_FD_TXCRC_SHIFT
#define CAN_FDCRC_FD_TXCRC_WIDTH        FLEXCAN_FDCRC_FD_TXCRC_WIDTH
#define CAN_FDCRC_FD_TXCRC(x)           FLEXCAN_FDCRC_FD_TXCRC(x)

#define CAN_FDCRC_FD_MBCRC_MASK         FLEXCAN_FDCRC_FD_MBCRC_MASK
#define CAN_FDCRC_FD_MBCRC_SHIFT        FLEXCAN_FDCRC_FD_MBCRC_SHIFT
#define CAN_FDCRC_FD_MBCRC_WIDTH        FLEXCAN_FDCRC_FD_MBCRC_WIDTH
#define CAN_FDCRC_FD_MBCRC(x)           FLEXCAN_FDCRC_FD_MBCRC(x)
/*! @} */

/*! @name ERFCR - Enhanced RX FIFO Control */
/*! @{ */

#define CAN_ERFCR_ERFWM_MASK            FLEXCAN_ERFCR_ERFWM_MASK
#define CAN_ERFCR_ERFWM_SHIFT           FLEXCAN_ERFCR_ERFWM_SHIFT
#define CAN_ERFCR_ERFWM_WIDTH           FLEXCAN_ERFCR_ERFWM_WIDTH
#define CAN_ERFCR_ERFWM(x)              FLEXCAN_ERFCR_ERFWM(x)

#define CAN_ERFCR_NFE_MASK              FLEXCAN_ERFCR_NFE_MASK
#define CAN_ERFCR_NFE_SHIFT             FLEXCAN_ERFCR_NFE_SHIFT
#define CAN_ERFCR_NFE_WIDTH             FLEXCAN_ERFCR_NFE_WIDTH
#define CAN_ERFCR_NFE(x)                FLEXCAN_ERFCR_NFE(x)

#define CAN_ERFCR_NEXIF_MASK            FLEXCAN_ERFCR_NEXIF_MASK
#define CAN_ERFCR_NEXIF_SHIFT           FLEXCAN_ERFCR_NEXIF_SHIFT
#define CAN_ERFCR_NEXIF_WIDTH           FLEXCAN_ERFCR_NEXIF_WIDTH
#define CAN_ERFCR_NEXIF(x)              FLEXCAN_ERFCR_NEXIF(x)

#define CAN_ERFCR_DMALW_MASK            FLEXCAN_ERFCR_DMALW_MASK
#define CAN_ERFCR_DMALW_SHIFT           FLEXCAN_ERFCR_DMALW_SHIFT
#define CAN_ERFCR_DMALW_WIDTH           FLEXCAN_ERFCR_DMALW_WIDTH
#define CAN_ERFCR_DMALW(x)              FLEXCAN_ERFCR_DMALW(x)

#define CAN_ERFCR_ERFEN_MASK            FLEXCAN_ERFCR_ERFEN_MASK
#define CAN_ERFCR_ERFEN_SHIFT           FLEXCAN_ERFCR_ERFEN_SHIFT
#define CAN_ERFCR_ERFEN_WIDTH           FLEXCAN_ERFCR_ERFEN_WIDTH
#define CAN_ERFCR_ERFEN(x)              FLEXCAN_ERFCR_ERFEN(x)
/*! @} */

/*! @name ERFIER - Enhanced RX FIFO Interrupt Enable */
/*! @{ */

#define CAN_ERFIER_ERFDAIE_MASK         FLEXCAN_ERFIER_ERFDAIE_MASK
#define CAN_ERFIER_ERFDAIE_SHIFT        FLEXCAN_ERFIER_ERFDAIE_SHIFT
#define CAN_ERFIER_ERFDAIE_WIDTH        FLEXCAN_ERFIER_ERFDAIE_WIDTH
#define CAN_ERFIER_ERFDAIE(x)           FLEXCAN_ERFIER_ERFDAIE(x)

#define CAN_ERFIER_ERFWMIIE_MASK        FLEXCAN_ERFIER_ERFWMIIE_MASK
#define CAN_ERFIER_ERFWMIIE_SHIFT       FLEXCAN_ERFIER_ERFWMIIE_SHIFT
#define CAN_ERFIER_ERFWMIIE_WIDTH       FLEXCAN_ERFIER_ERFWMIIE_WIDTH
#define CAN_ERFIER_ERFWMIIE(x)          FLEXCAN_ERFIER_ERFWMIIE(x)

