zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K566/S32K566_device.h
#define CAN_ERFIER_ERFOVFIE_MASK        FLEXCAN_ERFIER_ERFOVFIE_MASK
#define CAN_ERFIER_ERFOVFIE_SHIFT       FLEXCAN_ERFIER_ERFOVFIE_SHIFT
#define CAN_ERFIER_ERFOVFIE_WIDTH       FLEXCAN_ERFIER_ERFOVFIE_WIDTH
#define CAN_ERFIER_ERFOVFIE(x)          FLEXCAN_ERFIER_ERFOVFIE(x)

#define CAN_ERFIER_ERFUFWIE_MASK        FLEXCAN_ERFIER_ERFUFWIE_MASK
#define CAN_ERFIER_ERFUFWIE_SHIFT       FLEXCAN_ERFIER_ERFUFWIE_SHIFT
#define CAN_ERFIER_ERFUFWIE_WIDTH       FLEXCAN_ERFIER_ERFUFWIE_WIDTH
#define CAN_ERFIER_ERFUFWIE(x)          FLEXCAN_ERFIER_ERFUFWIE(x)
/*! @} */

/*! @name ERFSR - Enhanced RX FIFO Status */
/*! @{ */

#define CAN_ERFSR_ERFEL_MASK            FLEXCAN_ERFSR_ERFEL_MASK
#define CAN_ERFSR_ERFEL_SHIFT           FLEXCAN_ERFSR_ERFEL_SHIFT
#define CAN_ERFSR_ERFEL_WIDTH           FLEXCAN_ERFSR_ERFEL_WIDTH
#define CAN_ERFSR_ERFEL(x)              FLEXCAN_ERFSR_ERFEL(x)

#define CAN_ERFSR_ERFF_MASK             FLEXCAN_ERFSR_ERFF_MASK
#define CAN_ERFSR_ERFF_SHIFT            FLEXCAN_ERFSR_ERFF_SHIFT
#define CAN_ERFSR_ERFF_WIDTH            FLEXCAN_ERFSR_ERFF_WIDTH
#define CAN_ERFSR_ERFF(x)               FLEXCAN_ERFSR_ERFF(x)

#define CAN_ERFSR_ERFE_MASK             FLEXCAN_ERFSR_ERFE_MASK
#define CAN_ERFSR_ERFE_SHIFT            FLEXCAN_ERFSR_ERFE_SHIFT
#define CAN_ERFSR_ERFE_WIDTH            FLEXCAN_ERFSR_ERFE_WIDTH
#define CAN_ERFSR_ERFE(x)               FLEXCAN_ERFSR_ERFE(x)

#define CAN_ERFSR_ERFCLR_MASK           FLEXCAN_ERFSR_ERFCLR_MASK
#define CAN_ERFSR_ERFCLR_SHIFT          FLEXCAN_ERFSR_ERFCLR_SHIFT
#define CAN_ERFSR_ERFCLR_WIDTH          FLEXCAN_ERFSR_ERFCLR_WIDTH
#define CAN_ERFSR_ERFCLR(x)             FLEXCAN_ERFSR_ERFCLR(x)

#define CAN_ERFSR_ERFDA_MASK            FLEXCAN_ERFSR_ERFDA_MASK
#define CAN_ERFSR_ERFDA_SHIFT           FLEXCAN_ERFSR_ERFDA_SHIFT
#define CAN_ERFSR_ERFDA_WIDTH           FLEXCAN_ERFSR_ERFDA_WIDTH
#define CAN_ERFSR_ERFDA(x)              FLEXCAN_ERFSR_ERFDA(x)

#define CAN_ERFSR_ERFWMI_MASK           FLEXCAN_ERFSR_ERFWMI_MASK
#define CAN_ERFSR_ERFWMI_SHIFT          FLEXCAN_ERFSR_ERFWMI_SHIFT
#define CAN_ERFSR_ERFWMI_WIDTH          FLEXCAN_ERFSR_ERFWMI_WIDTH
#define CAN_ERFSR_ERFWMI(x)             FLEXCAN_ERFSR_ERFWMI(x)

#define CAN_ERFSR_ERFOVF_MASK           FLEXCAN_ERFSR_ERFOVF_MASK
#define CAN_ERFSR_ERFOVF_SHIFT          FLEXCAN_ERFSR_ERFOVF_SHIFT
#define CAN_ERFSR_ERFOVF_WIDTH          FLEXCAN_ERFSR_ERFOVF_WIDTH
#define CAN_ERFSR_ERFOVF(x)             FLEXCAN_ERFSR_ERFOVF(x)

#define CAN_ERFSR_ERFUFW_MASK           FLEXCAN_ERFSR_ERFUFW_MASK
#define CAN_ERFSR_ERFUFW_SHIFT          FLEXCAN_ERFSR_ERFUFW_SHIFT
#define CAN_ERFSR_ERFUFW_WIDTH          FLEXCAN_ERFSR_ERFUFW_WIDTH
#define CAN_ERFSR_ERFUFW(x)             FLEXCAN_ERFSR_ERFUFW(x)
/*! @} */

/*! @name HR_TIME_STAMP - High-Resolution Timestamp */
/*! @{ */

#define CAN_HR_TIME_STAMP_TS_MASK       FLEXCAN_HR_TIME_STAMP_TS_MASK
#define CAN_HR_TIME_STAMP_TS_SHIFT      FLEXCAN_HR_TIME_STAMP_TS_SHIFT
#define CAN_HR_TIME_STAMP_TS_WIDTH      FLEXCAN_HR_TIME_STAMP_TS_WIDTH
#define CAN_HR_TIME_STAMP_TS(x)         FLEXCAN_HR_TIME_STAMP_TS(x)
/*! @} */

/*! @name ERFFEL - Enhanced RX FIFO Filter Element */
/*! @{ */

#define CAN_ERFFEL_FEL_MASK             FLEXCAN_ERFFEL_FEL_MASK
#define CAN_ERFFEL_FEL_SHIFT            FLEXCAN_ERFFEL_FEL_SHIFT
#define CAN_ERFFEL_FEL_WIDTH            FLEXCAN_ERFFEL_FEL_WIDTH
#define CAN_ERFFEL_FEL(x)               FLEXCAN_ERFFEL_FEL(x)
/*! @} */


/*! @name CS - Message Buffer 0 CS Register..Message Buffer 20 CS Register */
/*! @{ */

#define CAN_CS_TIME_STAMP_MASK  (0xFFFFU)
#define CAN_CS_TIME_STAMP_SHIFT (0U)
/*! TIME_STAMP - Free-Running Counter Time stamp. This 16-bit field is a copy of the Free-Running
 *    Timer, captured for Tx and Rx frames at the time when the beginning of the Identifier field
 *    appears on the CAN bus.
 */
#define CAN_CS_TIME_STAMP(x) (((uint32_t)(((uint32_t)(x)) << CAN_CS_TIME_STAMP_SHIFT)) & CAN_CS_TIME_STAMP_MASK)

#define CAN_CS_DLC_MASK  (0xF0000U)
#define CAN_CS_DLC_SHIFT (16U)
/*! DLC - Length of the data to be stored/transmitted.
 */
#define CAN_CS_DLC(x) (((uint32_t)(((uint32_t)(x)) << CAN_CS_DLC_SHIFT)) & CAN_CS_DLC_MASK)

#define CAN_CS_RTR_MASK  (0x100000U)
#define CAN_CS_RTR_SHIFT (20U)
/*! RTR - Remote Transmission Request. One/zero for remote/data frame.
 */
#define CAN_CS_RTR(x) (((uint32_t)(((uint32_t)(x)) << CAN_CS_RTR_SHIFT)) & CAN_CS_RTR_MASK)

#define CAN_CS_IDE_MASK  (0x200000U)
#define CAN_CS_IDE_SHIFT (21U)
/*! IDE - ID Extended. One/zero for extended/standard format frame.
 */
#define CAN_CS_IDE(x) (((uint32_t)(((uint32_t)(x)) << CAN_CS_IDE_SHIFT)) & CAN_CS_IDE_MASK)

#define CAN_CS_SRR_MASK  (0x400000U)
#define CAN_CS_SRR_SHIFT (22U)
/*! SRR - Substitute Remote Request. Contains a fixed recessive bit.
 */
#define CAN_CS_SRR(x) (((uint32_t)(((uint32_t)(x)) << CAN_CS_SRR_SHIFT)) & CAN_CS_SRR_MASK)

#define CAN_CS_CODE_MASK  (0xF000000U)
#define CAN_CS_CODE_SHIFT (24U)

#define CAN_CS_CODE(x) (((uint32_t)(((uint32_t)(x)) << CAN_CS_CODE_SHIFT)) & CAN_CS_CODE_MASK)

#define CAN_CS_ESI_MASK  (0x20000000U)
#define CAN_CS_ESI_SHIFT (29U)
/*! ESI - Error State Indicator. This bit indicates if the transmitting node is error active or error passive.
 */
#define CAN_CS_ESI(x) (((uint32_t)(((uint32_t)(x)) << CAN_CS_ESI_SHIFT)) & CAN_CS_ESI_MASK)

#define CAN_CS_BRS_MASK  (0x40000000U)
#define CAN_CS_BRS_SHIFT (30U)
/*! BRS - Bit Rate Switch. This bit defines whether the bit rate is switched inside a CAN FD format frame.
 */
#define CAN_CS_BRS(x) (((uint32_t)(((uint32_t)(x)) << CAN_CS_BRS_SHIFT)) & CAN_CS_BRS_MASK)

#define CAN_CS_EDL_MASK  (0x80000000U)
#define CAN_CS_EDL_SHIFT (31U)
/*! EDL - Extended Data Length. This bit distinguishes between CAN format and CAN FD format frames.
 *    The EDL bit must not be set for Message Buffers configured to RANSWER with code field 0b1010.
 */
#define CAN_CS_EDL(x) (((uint32_t)(((uint32_t)(x)) << CAN_CS_EDL_SHIFT)) & CAN_CS_EDL_MASK)
/*! @} */


#define CAN_ID_EXT_MASK  (0x3FFFFU)
#define CAN_ID_EXT_SHIFT (0U)
/*! EXT - Contains extended (LOW word) identifier of message buffer.
 */
#define CAN_ID_EXT(x) (((uint32_t)(((uint32_t)(x)) << CAN_ID_EXT_SHIFT)) & CAN_ID_EXT_MASK)

#define CAN_ID_STD_MASK  (0x1FFC0000U)
#define CAN_ID_STD_SHIFT (18U)
/*! STD - Contains standard/extended (HIGH word) identifier of message buffer.
 */
#define CAN_ID_STD(x) (((uint32_t)(((uint32_t)(x)) << CAN_ID_STD_SHIFT)) & CAN_ID_STD_MASK)

#define CAN_ID_PRIO_MASK  (0xE0000000U)
#define CAN_ID_PRIO_SHIFT (29U)
/*! PRIO - Local priority. This 3-bit fieldis only used when LPRIO_EN bit is set in MCR and it only
 *    makes sense for Tx buffers. These bits are not transmitted. They are appended to the regular
 *    ID to define the transmission priority.
 */
#define CAN_ID_PRIO(x) (((uint32_t)(((uint32_t)(x)) << CAN_ID_PRIO_SHIFT)) & CAN_ID_PRIO_MASK)
/*! @} */


/* The count of CAN_WORD1 */
#define CAN_WORD1_COUNT (96U)

/*!
 * @}
 */ /* end of group FLEXCAN_Register_Masks */

/*!
 * @}
 */ /* end of group FLEXCAN_Peripheral_Access_Layer */

#endif /* _S32K566_DEVICE_H_ */
